Repository: imagestream/opuntia-docs
Catalog: locales/*/LC_MESSAGES/ap3500.po
Languages: es

source: AP3500 Hardware details
es: Información del hardware del AP3500

source: Table of Contents
es: Índice

source: Hardware Description
es: Descripción del hardware

source: The AP3500 is a outdoor wire access point designed to be used in Point to Point or Point to Multipoint applications. The AP3500 is designed to attach to a number of different external anntena units. These feature differing Gain, beam widths and mounting options for differing deplyoments.
es: El AP3500 es un punto de acceso alámbrico para exteriores diseñado para utilizarse en aplicaciones Punto a Punto o Punto a Multipunto. El AP3500 está diseñado para acoplarse a diferentes unidades externas de antena. Estos cuentan con Ganancias, ángulo de radiación y opciones de montaje diferentes para implementaciones diversas.

source: 90° beam width sector anntena with 9.6dBi Gain
es: Antena sectorial con ángulo de radiación de 90° con ganancia de 9.6dBi

source: 60° beam width sector anntena with 13.2dBi Gain
es: Antena sectorial con ángulo de radiación de 60° con ganancia de 13.2dBi

source: 30° beam width sector anntena with 18.4dBi Gain
es: Antena sectorial con ángulo de radiación de 30° con ganancia de 18.4dBi

source: Point to Point dish anntena with 24.5dBi Gain
es: Antena parabólica punto a punto con ganancia de 24.5dBi

source: Point to Point dish anntena with 27.5dBi Gain
es: Antena parabólica punto a punto con ganancia de 27.5dBi

source: **Block Diagram**
es: **Diagrama de bloques**

source: The AP3500 features a dual core 880Mhz 32bit Mips1004kc procressor. This is connected to 256MB of DDR2 memory, 16MB of NAND flash, it features a single 1Gbit/sec Ethernet interface and a Wireless radio interface. The CPU features a network accelerator that supports 2Gbps of IPv4/6 routing, NAT and NAPT+HQoS.
es: El AP3500 cuenta con un procesador de doble núcleo a 880Mhz, 32 bits.Mips1004kc. Está conectado a una memoria DDR2 de 256 MB, 16 MB de memoria flash NAND, cuenta con una interfaz Ethernet de 1 Gbit/s simple y una interfaz de radio inalámbrica. La CPU cuenta con un acelerador de red que soporta 2Gbps de routing IPv4/6, NAT y NAPT+HQoS.

source: The system is powered by Ethernet PoE using the IEEE 802.3af standard.
es: El sistema se alimenta mediante Ethernet PoE utilizando el estándar IEEE 802.3af.

source: Visual Guide
es: Guía visual

source: **Front View**
es: **Vista frontal**

source: **Side View**
es: **Vista lateral**

source: **Port View**
es: **Vista del puerto**

source: AP3500 QuickStart Guide
es: Guía de inicio rápido del AP3500

source: The AP3500 is configured by default to allow access via several different methods.
es: El AP3500 está configurado por defecto para permitir el acceso a través de varios métodos diferentes.

source: Access via Ethernet using the Web Interface
es: Acceso vía Ethernet mediante la interfaz web

source: Access via Ethernet using SSH
es: Acceso vía Ethernet mediante SSH

source: Ethernet Connectivity
es: Conectividad Ethernet

source: The Ethernet interface on the AP3500 supports auto mdi/mdix so the interface can be connected directly to a client device or an Ethernet switch with a standard Ethernet cable.
es: La interfaz Ethernet del AP3500 es compatible con auto-mdi/mdix, por lo que la interfaz puede conectarse directamente a un dispositivo cliente o a un conmutador Ethernet con un cable Ethernet estándar.

source: The AP3500 has a single Ethernet interface. The default configuration of the AP3500 is to bridge the Ethernet interface with the wireless radio. Due to this default configuration the AP3500 defaults to acting as a DHCP client. It will receive an ip address from any existing DHCP servers that are present on the network connected to the Ethernet interface.
es: El AP3500 tiene una interfaz Ethernet simple. La configuración por defecto del AP3500 es la de puentear la interfaz Ethernet con la radio inalámbrica. Debido a esta configuración predeterminada, el AP3500 actúa por defecto como cliente DHCP. Recibirá una dirección ip de cualquier servidor DHCP existente que se encuentre presente en la red conectada a la interfaz Ethernet.

source: If the AP3500 fails to obtain an DHCP lease within the first 60 seconds; the AP3500 will switch modes and it will assign 10.10.199.1/24 to the Ethernet interface. In this failback mode the AP3500 will then be accessable using this self-assigned address.
es: Si el AP3500 no consigue obtener una concesión DHCP en los primeros 60 segundos, el AP3500 cambiará de modo y asignará 10.10.199.1/24 a la interfaz Ethernet. En este modo de emergencia (failback), el AP3500 será accesible utilizando esta dirección autoasignada.

source: Once you have determined the correct IPv4 address you can then move to accessing the AP3500 via the Web GUI or via SSH.
es: Una vez que usted haya determinado la dirección IPv4 correcta, puede seguir para acceder al AP3500 a través de la GUI Web o vía SSH.

source: The AP3500 will obtain an IPv6 address using DHCPv6 or SLAAC (Stateless Address Autoconfiguration) if these methods are present on the connected network.
es: El AP3500 obtendrá una dirección IPv6 utilizando DHCPv6 o SLAAC (Configuración automática de direcciones sin estado) si estos métodos están presentes en la red conectada.

source: The AP3500 will always configure an IPv6 Link local address based on the MAC address([1]_) of the AP3500. This Link local IPv6 address is present at all times even if IPv4 and other IPv6 configurations are invalid. So the Link local address is the most relaible way to access the AP3500. Since this address is based on the MAC address of the Ethernet interface it is unquie to each AP3500. An easy method to determine this address is to send a ping packet to the IPv6 "all routers" multicast address(ff02::2).
es: El AP3500 siempre configurará una dirección de enlace local IPv6 basada en la dirección MAC ([1]_) del AP3500. Esta dirección de enlace local IPv6 está presente en todo momento, incluso si otras configuraciones IPv4 e IPv6 no son válidas. Por lo tanto, la dirección de enlace local es la forma más fiable de acceder al AP3500. Dado que esta dirección se basa en la dirección MAC de la interfaz Ethernet, es única para cada AP3500. Un método sencillo para determinar esta dirección es enviar un paquete ping a la dirección multicast IPv6 "de todos los router" (ff02::2).

source: For Linux systems this can be done using the following command assuming your Ethernet interface is "eth0". Please note that most operating systems require specifiying the interface in addtion to the address when using Link Local addresses. For example Linux systems would use the following syntax if your interface was "eth0"::
es: Para los sistemas Linux esto se puede hacer mediante el siguiente comando asumiendo que su interfaz Ethernet es "eth0". Tenga en cuenta que la mayoría de los sistemas operativos requieren que se especifique la interfaz además de la dirección cuando se utilizan direcciones de enlace local. Por ejemplo, los sistemas Linux utilizarían la siguiente sintaxis si su interfaz fuera "eth0"::

source: Additionally it's possible to compute the Link Local address using the MAC address. Numerious online calculators can be used to easily find the Link local address([2]_) using the MAC address located on the product label. Note; the AP3500 will have a MAC address that begins with "B0:91:37".
es: Además, es posible calcular la dirección de enlace local utilizando la dirección MAC. Se pueden utilizar varias calculadoras en línea para encontrar fácilmente la dirección de enlace local ([2]_) por medio de la dirección MAC que se encuentra en la etiqueta del producto. Nota; el AP3500 tendrá una dirección MAC que empieza con "B0:91:37".

source: Once you have determined the correct IPv6 address you can then move to accessing the AP3500 via the Web GUI or via SSH.
es: Una vez que usted haya determinado la dirección IPv6 correcta, puede seguir para acceder al AP3500 a través de la GUI Web o vía SSH.

source: Web GUI Access
es: Acceso a la interfaz gráfica de usuario (GUI) en la web

source: **Access via Ethernet using the Web Interface - IPv4**
es: ** Acceso vía Ethernet mediante la interfaz web - IPv4**

source: This interface defaults to a network address range of 10.10.199.0/24 with the router configured as 10.10.199.1 and supports DHCP client access.
es: Esta interfaz tiene por defecto un intervalo de direcciones de red de 10.10.199.0/24 con el router configurado como 10.10.199.1 y es compatible con el acceso de cliente DHCP.

source: When the AP3500 is using the failback IPv4 address access the login page use the following url: `https://10.10.199.1/ <https://10.10.199.1>`_
es: Cuando el AP3500 está utilizando la dirección IPv4 de emergencia (failback) acceder a la página de inicio de sesión en la siguiente url: `https://10.10.199.1/ <https://10.10.199.1>`_

source: The AP3500 ships with a self-signed ssl certificate. This may cause warning in when connecting to the AP3500 for the first time. These warnings can be safely ignored for accessing the management Web GUI.
es: El AP3500 se entrega con un certificado ssl auto-firmado. Esto puede causar una advertencia al conectarse al AP3500 por primera vez. Estas advertencias pueden ignorarse de manera segura para acceder a la GUI Web de gestión.

source: The admin username is "**root**". The default password is "**imagestream**".
es: El nombre de usuario del administrador es "**root**". La contraseña por defecto es "**imagestream**".

source: We strongly recommend that you change the default password as your first configuration change.
es: Le recomendamos encarecidamente que cambie la contraseña predeterminada como primer cambio en la configuración.

source: **Access via Ethernet using the Web Interface - IPv6**
es: ** Acceso vía Ethernet mediante la interfaz web - IPv6**

source: To access the Web GUI using using IPv6 the method is similar to using IPv4. To enter a IPv6 addresses in a web browser use the following syntax. If we assume that you determined your Ipv6 Link Local address is "fe80::b291:37ff:fe05:1" then the correct url would be as follows::
es: Para acceder a la GUI Web utilizando IPv6 el método es similar al de utilizar IPv4. Para introducir una dirección IPv6 en un navegador web utilice la siguiente sintaxis. Si asumimos que usted determinó que su dirección de enlace local Ipv6 es "fe80::b291:37ff:fe05:1" entonces la url correcta sería la siguiente::

source: CLI Access via SSH
es: Acceso CLI vía SSH

source: **IPv4 & IPv6**
es: **IPv4 e IPv6**

source: The AP3500 can also be accessed via SSH. Using the ip address of the AP3500 connect as user root. If the AP3500 is in failback IPv4 mode the ip address will be 10.10.199.1. If the AP3500 is using DHCP or DHCPv6 you need to determine which address was a assigned by looking at your DHCP sever. In the following screenshot the address was assigned via DHCP.
es: El AP3500 también se puede acceder vía SSH. Usando la dirección ip del AP3500 conéctese como usuario root. Si el AP3500 está en modo IPv4 de emergencia (failback) la dirección ip será 10.10.199.1. Si el AP3500 está usando DHCP o DHCPv6 necesita determinar qué dirección fue asignada revisando su servidor DHCP. En la siguiente captura de pantalla la dirección fue asignada vía DHCP.

source: Footnotes
es: Notas a pie de página

source: Using the RFC4862 standard for Link Local address creation
es: Uso del estándar RFC4862 para la creación de direcciones de enlace local

source: https://ben.akrin.com/?p=1347 Ipv6 Link Local Calculator
es: https://ben.akrin.com/?p=1347 Calculador de enlace local Ipv6
