Repository: imagestream/opuntia-docs
Catalog: locales/*/LC_MESSAGES/ev1000.po
Languages: es

source: Ev1000 Hardware details
es: Información del hardware del Ev1000

source: EV1000 QuickStart Guide
es: Guía de inicio rápido del EV1000

source: Table of Contents
es: Índice

source: The EV1000 is configured by default to allow access via several different methods.
es: El EV1000 está configurado por defecto para permitir el acceso a través de varios métodos diferentes.

source: Access via Ethernet using the Web Interface
es: Acceso vía Ethernet mediante la interfaz web

source: Access via Ethernet using SSH
es: Acceso vía Ethernet mediante SSH

source: Access via the Serial Interface
es: Acceso vía interfaz serie

source: Ethernet Connectivity
es: Conectividad Ethernet

source: The Ethernet interface on the EV1000 supports auto mdi/mdix so the interface can be connected directly to a client device or an Ethernet switch with a standard Ethernet cable.
es: La interfaz Ethernet del EV1000 es compatible con auto-mdi/mdix, por lo que la interfaz puede conectarse directamente a un dispositivo cliente o a un conmutador Ethernet con un cable Ethernet estándar.

source: The EV1000 has three Ethernet interfaces. These are marked on the back of the EV1000 as Eth0, Eth1 and Eth2. Below is a description of the factory default configuration EV1000. It is possible to change these defaults once this unit is configured.
es: El EV1000 cuenta con tres interfaces Ethernet. Están marcadas en la parte posterior del EV1000 como Eth0, Eth1 y Eth2. Más adelante se muestra una descripción de la configuración predeterminada de fábrica del EV1000. Es posible cambiar estos valores predeterminados durnt ela configuración de la unidad.

source: **Eth0 and Eth1**
es: **Eth0 y Eth1**

source: The Eth0 and Eth1 interface are part of the Wan Firewall Zone. It will Source Nat traffic flowing out these interfaces by default.
es: Las interfaces Eth0 y Eth1 forman parte de la Zona del Cortafuegos (firewall) de la Wan. De manera predeterminada, fluirá tráfico Source Nat por estas interfaces.

source: The Eth2 interface is configured as the default management interface. This interface is connfigured as a DHCP and DHCPv6 server. The default ip address of this interface is 10.10.199.1/24. It will provide DHCP for the 10.10.199.0/24 network. This interface is in the management firewall zone.
es: La interfaz Eth2 se configura como interfaz de gestión predeterminada. Esta interfaz está configurada como servidor DHCP y DHCPv6. La dirección ip predeterminada de esta interfaz es 10.10.199.1/24. Proporcionará DHCP para la red 10.10.199.0/24. Esta interfaz se encuentra en la zona del firewall de gestión.

source: If the EV1000 obtains an IPv6 prefix deligation using DHCPv6 on either Eth0 or Eth1; then an IPv6 network will be configured on the management interface.
es: Si el EV1000 obtiene una delegación de prefijo IPv6 mediante DHCPv6 en Eth0 o Eth1, entonces se configurará una red IPv6 en la interfaz de gestión.

source: **All Ethernet Interfaces**
es: **Todas las interfaces Ethernet**

source: The EV1000 will always configure an IPv6 Link local address based on the MAC address([1]_) of the EV1000. This Link local IPv6 address is present at all times even if IPv4 and other IPv6 configurations are invalid. So the Link local address is the most relaible way to access the EV1000. Since this address is based on the MAC address of the Ethernet interface it is unquie to each EV1000 interface so it's often not the most convenient as you must determine the specific address. One method to determine this address is to send a ping packet to the IPv6 "all routers" multicast address(ff02::2).
es: El EV1000 configurará siempre una dirección de enlace local IPv6 basada en la dirección MAC([1]_) del EV1000. Esta dirección de enlace local IPv6 está presente en todo momento, incluso si otras configuraciones IPv4 e IPv6 no son válidas. De esta forma la dirección de enlace local es la forma más fiable de acceder al EV1000. Dado que esta dirección se basa en la dirección MAC de la interfaz Ethernet es única para cada interfaz del EV1000 por lo que no es común que sea la forma más conveniente para determinar la dirección específica. Un método para determinar esta dirección es enviar un paquete ping a la dirección multicast IPv6 "todos los Routers" (ff02::2).

source: For Linux systems this can be done using the following command assuming your Ethernet interface is "eth0". Please note that most operating systems require specifiying the interface in addtion to the address when using Link Local addresses. For example Linux systems would use the following syntax if your interface was "eth0"::
es: Para los sistemas Linux esto se puede hacer mediante el siguiente comando asumiendo que su interfaz Ethernet es "eth0". Tenga en cuenta que la mayoría de los sistemas operativos requieren que se especifique la interfaz además de la dirección cuando se utilizan direcciones de enlace local. Por ejemplo, los sistemas Linux utilizarían la siguiente sintaxis si su interfaz fuera "eth0"::

source: Additionally it's possible to compute the Link Local address using the MAC address. Numerious online calculators can be used to easily find the Link local address([2]_) using the MAC address located on the product label.
es: Además, es posible calcular la dirección de enlace local utilizando la dirección MAC. Se pueden utilizar varias calculadoras en línea para encontrar fácilmente la dirección de enlace local ([2]_) por medio de la dirección MAC que se encuentra en la etiqueta del producto.

source: Once you have determined the correct IPv4 or IPv6 address you can then move to accessing the EV1000 via the Web GUI or via SSH.
es: Una vez que usted haya determinado la dirección IPv4 o IPv6 correcta, puede seguir para acceder al EV1000 a través de la interfaz de usuario gráfica en línea, GUI Web o vía SSH.

source: Serial Connectivity
es: Conectividad en serie

source: The EV1000 features a DE-9([3]_) connector using the Rs232 Serial standard. You will need a **Null Serial** connection to connect to this interface. The interface will be running at a baud rate 115,200 bps and using 8 data bits; no parity bit and 1 stop bit; or commonly known as "115.2kbps 8n1".
es: El EV1000 dispone de un conector DE-9([3]_) que utiliza el estándar serie Rs232. Necesitará una conexión **Serie nula** para conectarse a esta interfaz. La interfaz funcionará a una tasa de baudios de 115,200 bps y utilizará 8 bits de datos; sin bit de paridad y 1 bit de parada; o comúnmente conocido como "115.2kbps 8n1".

source: The most likely cause of problems when using the Serial interface is issues with incorrect cables. As noted above, a **Null Serial** cable is required.
es: La causa más probable de los problemas al utilizar la interfaz serie son los causados por el uso de cables incorrectos. Como se ha indicado anteriormente, se necesita un cable **Serie Nulo**.

source: Web GUI Access
es: Acceso a la interfaz gráfica de usuario (GUI) en la web

source: **Access via Ethernet using the Web Interface**
es: ** Acceso vía Ethernet mediante la interfaz web**

source: The management interface (Eth2) defaults to a network address range of 10.10.199.0/24 with the router configured as 10.10.199.1 and supports DHCP client access. If connecting via this interface the address access the login page is the following url: `https://10.10.199.1/ <https://10.10.199.1>`_
es: La interfaz de gestión (Eth2) tiene por defecto un intervalo de direcciones de red de 10.10.199.0/24 con el router configurado como 10.10.199.1 y es compatible con el acceso de cliente DHCP. Si se conecta a través de esta interfaz, la dirección de acceso a la página de inicio de sesión es la siguiente url: `https://10.10.199.1/ <https://10.10.199.1>`_

source: Additionally the EV1000 can be accessed on the Eth0 and Eth1 either using the IP addresses assigned via DHCP/DHCPv6 or Ipv6 Link Local address.
es: Además, se puede acceder al EV1000 en Eth0 y Eth1 utilizando las direcciones IP asignadas a través de DHCP/DHCPv6 o la dirección de enlace local Ipv6.

source: The EV1000 ships with a self-signed ssl certificate. This may cause warning in when connecting to the EV1000 for the first time. These warnings can be safely ignored for accessing the management Web GUI.
es: El EV1000 se entrega con un certificado ssl auto-firmado. Esto puede causar una advertencia al conectarse al EV1000 por primera vez. Estas advertencias pueden ignorarse de manera segura para acceder a la GUI Web de gestión.

source: The admin username is "**root**". The default password is "**imagestream**".
es: El nombre de usuario del administrador es "**root**". La contraseña por defecto es "**imagestream**".

source: We strongly recommend that you change the default password as your first configuration task.
es: Le recomendamos encarecidamente que cambie la contraseña predeterminada como primera tarea en la configuración.

source: **Access via Ethernet using the Web Interface: Link Local details**
es: ** Acceso vía Ethernet mediante la interfaz web** Información del enlace local**

source: To access the Web GUI using using the IPv6 Link Local the method is similar to using IPv4. To enter a IPv6 addresses in a web browser use the following syntax. If we assume that you determined your Ipv6 Link Local address is "fe80::b291:37ff:fe05:1" then the correct url would be as follows::
es: Para acceder a la GUI Web utilizando el enlace local IPv6, el método es similar al de utilizar IPv4. Para introducir una dirección IPv6 en un navegador web utilice la siguiente sintaxis. Si asumimos que usted determinó que su dirección de enlace local Ipv6 es "fe80::b291:37ff:fe05:1" entonces la url correcta sería la siguiente::

source: CLI Access via SSH
es: Acceso CLI vía SSH

source: **IPv4 & IPv6**
es: **IPv4 e IPv6**

source: The EV1000 can also be accessed via SSH. Using the ip address of the EV1000 connect as user root. If you are connecting to the management interface of the EV1000 the ip address will be 10.10.199.1. If you are connecting to either Eth0 or Eth1 the EV1000 will be using DHCP or DHCPv6 and you will need to determine which address was a assigned by looking at your DHCP sever. In the following screenshot the address was assigned via DHCP.
es: El EV1000 también se puede acceder vía SSH. Usando la dirección ip del EV1000 conéctese como usuario root. Si se conecta a la interfaz de gestión del EV1000 la dirección ip será 10.10.199.1. Si se conecta a Eth0 o Eth1, el EV1000 estará usando DHCP o DHCPv6 y tendrá que determinar qué dirección fue asignada revisando su servidor DHCP. En la siguiente captura de pantalla la dirección fue asignada vía DHCP.

source: CLI Access via the Serial Interface
es: Acceso CLI vía interfaz serie

source: The EV1000 has a built in DE-9 Rs232 Interface. When connecting via the Serial Interface; to access the CLI no password is currently required (as of Opuntia version 4.8.16). Just connect using this interface (for details see above) and press the "enter" key.
es: El EV1000 cuenta con una interfaz DE-9 Rs232 integrada. Cuando se conecta vía Interfaz Serie; para acceder a la CLI no se requiere actualmente ninguna contraseña (a partir de la versión 4.8.16 de Opuntia). Sólo tiene que conectarse mediante esta interfaz (para más información, véase más arriba) y pulsar la tecla "enter".

source: Firewall defaults
es: Valores predeterminados del cortafuegos (firewall)

source: The table below describes the default firewall zone and policy for the EV1000.
es: La siguiente tabla describe la zona y la política de cortafuegos predeterminadas para el EV1000.

source: Firewall Interface defaults
es: Valores predeterminados de la Interfaz del cortafuegos

source: Interface Name
es: Nombre de la interfaz

source: Default Zone
es: Zona predeterminada

source: Input policy
es: Política de entrada

source: Forward policy
es: Política de avance

source: Output policy
es: Política de salida

source: Accept
es: Aceptar

source: Management
es: Gestión

source: Footnotes
es: Notas a pie de página

source: Using the RFC4862 standard for Link Local address creation
es: Uso del estándar RFC4862 para la creación de direcciones de enlace local

source: https://ben.akrin.com/?p=1347 Ipv6 Link Local Calculator
es: https://ben.akrin.com/?p=1347 Calculador de enlace local Ipv6

source: The DE-9 connector is often incorrectly known as a DB-9 interface.
es: El conector DE-9 suele conocerse incorrectamente como interfaz DB-9.
