Repository: imagestream/opuntia-docs
Catalog: locales/*/LC_MESSAGES/index.po
Languages: es

source: Welcome to Opuntia documentation!
es: ¡Bienvenido a la documentación de Opuntia!

source: Opuntia is a high performance routing and edge computing platform based on the Linux kernel and OpenWRT project. It's focused on providing advanced routing and edge computing features.
es: Opuntia es una plataforma de enrutamiento (routing) y computación de borde (edge computing) de alto desempeño basada en el núcleo (kernel) de Linux y el proyecto OpenWRT. Se centra en proporcionar funciones avanzadas de enrutamiento (routing) y computación de borde (edge computing).

source: Opuntia User Manual
es: Manual del usuario de Opuntia

source: Rebel Router:
es: Router Rebelde:

source: Envoy Router:
es: Router Envoy:

source: AP2100 Access Point:
es: Punto de acceso AP2100:

source: AP3500 Access Point:
es: Punto de acceso AP3500:

source: Samurai Router:
es: Router Samurai:

source: Indices and tables
es: Índices y tablas

source: :ref:`search`
es: :ref:`búsqueda`
