Repository: imagestream/opuntia-docs
Catalog: locales/*/LC_MESSAGES/Opuntia-manual.po
Languages: es

source: When accesing Network interface configuration is stored in the file at location */etc/config/network*. You can edit this file with vi or nano. After making changes to the configuration files you need to run the following command from the system shell. ::
es: Al acceder a la interfaz de red, la configuración se almacena en un archivo en la ubicación */etc/config/network*. Puede editar este archivo con vi o nano. Después de realizar los cambios en los archivos de configuración es necesario ejecutar el siguiente comando desde la consola del sistema. ::

source: This will force the system to reload the running configuration from the saved config files. Since the static protocol is often used with DHCP/DHCPv6 server settings we will also cover that configuration in this section. The DHCP server settings are located at */etc/config/dhcp*.
es: Esto forzará al sistema a recargar la configuración en ejecución desde los archivos de configuración guardados. Dado que el protocolo estático se utiliza a menudo con la configuración del servidor DHCP/DHCPv6, también cubriremos esa configuración en esta sección. La configuración del servidor DHCP se encuentra en */etc/config/dhcp*.

source: When directly configuring the any settings in the configuration files it is possible to input invalid settings. Take care to enter correct values.
es: Al configurar directamente los ajustes en los archivos de configuración, es posible que se introduzcan ajustes no válidos. Tenga cuidado de introducir los valores correctos.

source: **Interface IPv4 settings**
es: **Configuración de la interfaz IPv4**

source: Below we will cover a few common IPv4 configuration scenarios and what the configuration file format will look like in those deployments.
es: A continuación cubriremos algunos escenarios comunes de configuración de IPv4 y cómo será el formato del archivo de configuración en esas implementaciones.

source: This example sets a static IPv4 address on interface named "Home_Lan" and a DHCP server on the interface with a ip-pool range of 192.168.85.10 - 192.168.85.250 with a leasetime. The two configuration files that need to be modified are /etc/config/network for the interface configuration. And /etc/config/dhcp for the DHCP server configuration.
es: Este ejemplo establece una dirección IPv4 estática en la interfaz llamada "Home_Lan" y un servidor DHCP en la interfaz con un intervalo de ip-pool de 192.168.85.10 - 192.168.85.250 con un tiempo de cesión (leasetime). Los dos archivos de configuración que hay que modificar son /etc/config/network para la configuración de la interfaz. Y /etc/config/dhcp para la configuración del servidor DHCP.

source: **IPv4 CLI Options**
es: **Opciones CLI IPv4**

source: Here is a list of common configuration options for IPv4 interfaces and value descriptions.
es: A continuación se muestra una lista de opciones de configuración comunes para las interfaces IPv4 y las descripciones de los valores.

source: Name
es: Nombre

source: Type
es: Tipo

source: Required
es: Requerido

source: Description of the command
es: Descripción del comando

source: Interface Name
es: Nombre de la interfaz

source: Yes
es: Sí

source: Physical Interface Name
es: Nombre de la interfaz física

source: Protocol Type
es: Tipo de protocolo

source: Protocol
es: Protocolo

source: ip address
es: dirección ip

source: Ip address CIDR list
es: Lista CIDR de direcciones IP

source: IPv4 Subnet mask
es: Máscara de subred IPv4

source: Default IPv4 gateway
es: Puerta de enlace IPv4 predeterminada

source: Broadcast IPv4 address
es: Dirección IPv4 de difusión

source: list of ip addresses
es: lista de direcciones ip

source: Dns Server List
es: Lista de servidores Dns

source: integer
es: entero

source: Route metric for this interface
es: Métrica de ruta para esta interfaz

source: Here is a list of common IPv4 DHCP Configuraion options.
es: Esta es una lista de las opciones de configuración de DHCP IPv4 más comunes.

source: interface name
es: nombre de la interfaz

source: Opuntia Interface name
es: Nombre de la interfaz de Opuntia

source: Ignore IPv4 DHCP server on this interface
es: Ignorar el servidor DHCP IPv4 en esta interfaz

source: IPv4 dhcp pool start address ofset
es: Ajuste de inicio del grupo de direcciones dhcp IPv4

source: Number of addresses in the IPv4 dhcp pool
es: Número de direcciones en el grupo dhcp IPv4

source: Time
es: Tiempo

source: Lifetime of the dhcp lease (hours or minutes)
es: Tiempo de vida de la concesión dhcp (horas o minutos)

source: list of DNS addresses
es: lista de direcciones DNS

source: Lists of dns servers to advertise to dhcp clients
es: Listas de servidores dns para notificar a los clientes dhcp

source: **Interface IPv6 settings**
es: **Configuración de la interfaz IPv6**

source: Below we will cover a few common IPv6 configuration scenarios and what the configuration file format will look like in those deployments.
es: A continuación cubriremos algunos escenarios comunes de configuración de IPv6 y cómo será el formato del archivo de configuración en esas implementaciones.

source: This example shows you a typical dual stack IPv4 / IPv6 where you are receiving a IPv6 Prefix Delegation. This example shows that you are only required to configure the ip6assign length. This will then use the built-in IPv6 management to determine the correct IPv6 Subnet to assign to the interface. Since the IPv6 suffix(ip6ifaceid) has a default value of "::1" the typical configuration only has the 'ip6assign' option configured.
es: Este ejemplo muestra una típica pila dual IPv4 / IPv6 donde se recibe una Delegación de Prefijo IPv6. Este ejemplo muestra que sólo es necesario configurar la longitud ip6assign. A continuación, se utilizará la gestión incorporada de IPv6 para determinar la subred IPv6 correcta para asignar a la interfaz. Como el sufijo IPv6(ip6ifaceid) tiene un valor predeterminada de "::1" la configuración típica sólo tiene configurada la opción 'ip6assign'.

source: We are also configuring DHCPv6 to allocate addresses from the assigned IPv6 Prefix. This is configuration example for working in a dual-stack enviorment.
es: También estamos configurando el DHCPv6 para que asigne las direcciones a partir del prefijo IPv6 asignado. Este es un ejemplo de configuración para trabajar en un entorno de doble pila.

source: This example shows the simplest IPv6 configuraion. This requests a /64 IPv6 netblock to be assigned to the interface. This will cause the system try to obtain a valid public IPv6 network to assign to the interface. This address space is allocated from the assigned IPv6 prefix delegation that the system obtained via DHCPv6. If there is insufficient IPv6 address space, the system will not assign a /64.
es: Este ejemplo muestra la configuración más sencilla de IPv6. Solicita que se asigne un bloque de red IPv6 /64 a la interfaz. Esto hará que el sistema intente obtener una red pública IPv6 válida para asignar a la interfaz. Este espacio de direcciones se asigna a partir de la delegación de prefijos IPv6 asignados que el sistema obtuvo mediante DHCPv6. Si no hay suficiente espacio de direcciones IPv6, el sistema no asignará un /64.

source: This DHCP/DHCPv6 configuraion shows how to set the Opuntia system as a DHCPv6 server. And allows for the system to do prefix delegation to downstream devices. This is typically combinded with the simple Dual Stack interface configuraion above.
es: Esta configuración DHCP/DHCPv6 muestra cómo configurar el sistema Opuntia como servidor DHCPv6. Y permite que el sistema haga una delegación de prefijos a los dispositivos descendentes. Esto se suele combinar con la configuración simple de la interfaz de pila doble anterior.

source: This example shows two static IPv6 addresses assigned to the Home_Lan Interface.
es: Este ejemplo muestra dos direcciones IPv6 estáticas asignadas a la interfaz Home_Lan.

source: This example shows a configuration of a pure IPv6 network. This uses the built-in IPv6 management to assign the /64 netblock.
es: Este ejemplo muestra una configuración de una red IPv6 pura. Utiliza la gestión incorporada de IPv6 para asignar el bloque de red /64.

source: **IPv6 CLI Options**
es: **Opciones CLI IPv6**

source: To access the Opuntia systems CLI interface please see the :ref:`Access-SSH` chapter of the manual.
es: Para acceder a la interfaz CLI de los sistemas Opuntia, consulte el capítulo :ref:`Acceso-SSH` del manual.

source: Common configuraion options are listed in the table below.
es: Las opciones de configuración más comunes se enumeran en la siguiente tabla.

source: ipv6 address
es: dirección ipv6

source: Yes / No*
es: Sí / No*

source: IPv6 Address (not required if an IPv4 ipaddr is set)
es: Dirección IPv6 (no es necesaria si se establece una dirección IPv4)

source: ipv6 suffix
es: sufijo ipv6

source: IPv6 Interface ID ( fixed value, Random, eui64)
es: ID de interfaz IPv6 ( valor fijo, aleatorio, eui64)

source: IPv6 Default Gateway
es: Puerta de enlace IPv6 predeterminada

source: prefix length
es: longitud del prefijo

source: Delegate a prefix of this length
es: Delegar un prefijo de esta longitud

source: prefix hint
es: indicación de prefijo

source: Prefix hint in Hex format
es: Indicación de prefijo en formato Hex

source: ipv6 prefix
es: prefijo ipv6

source: IPv6 prefix for distribution to clients devices
es: Prefijo IPv6 para distribución a los dispositivos cliente

source: server mode
es: modo servidor

source: DHCPv6 server ( server, relay or hybrid )
es: Servidor DHCPv6 (servidor, relé o híbrido)

source: Router Advertisement mode (server, relay or hybrid)
es: Modo de notificación del router (servidor, relé o híbrido)

source: DHCPv6 mode ( 1: Stateless + Stateful )
es: Modo DHCPv6 ( 1: Sin estado + Con estado)

source: DHCP Client
es: Cliente DHCP

source: The "DHCP client" protocol configures an interface to request a IPv4 using the DHCP protocol. When connecting as a client device to a network this is often the desired configuration since it allows automatic configuration of the IPv4 address and DNS settings.
es: El protocolo "cliente DHCP" configura una interfaz para solicitar un IPv4 mediante el protocolo DHCP. Cuando se conecta como dispositivo cliente a una red, esta suele ser la configuración deseada, ya que permite la configuración automática de la dirección IPv4 y de los ajustes DNS.

source: Dual Stack IPv4 and IPv6 requires separate Opuntia Interfaces. By default Opuntia has a *Wan* Interface for DHCP and a *Wan_6* Interface for DHCPv6 the physical interface needs to be set to the upstream interface.
es: La pila dual IPv4 e IPv6 requiere interfaces de Opuntia separadas. Por defecto, Opuntia tiene una interfaz *Wan* para DHCP y una interfaz *Wan_6* para DHCPv6. La interfaz física se debe configurar para la interfaz ascendente.

source: For more information on Dual Stack configurations see the :ref:`Wired-DHCPv6-Client` section.
es: Para más información sobre las configuraciones de pila dual o doble, consulte la sección :ref:`Cliente DHCPv6-alámbrico`.

source: This screenshot shows you the basic DHCP interface configuration. Since protocol "DHCP client" requests the network configuration from a DHCP server, there is little user configuration required. The most important user configuration setting is likely to be the choice of Firewall zone in the Firewall settings tab. Since "DHCP client" is often configured on interfaces connected to upstream Internet access the default *wan* firewall zone is likely the correct setting.
es: Esta captura de pantalla muestra la configuración básica de la interfaz DHCP. Dado que el protocolo "cliente DHCP" solicita la configuración de la red a un servidor DHCP, se requiere poca configuración por parte del usuario. El ajuste más importante de la configuración del usuario es probablemente la elección de la zona del Cortafuegos en la pestaña de configuración del cortafuegos. Dado que el "cliente DHCP" suele estar configurado en interfaces conectadas al acceso a Internet ascendente, la zona del cortafuegos *wan* predeterminada es probablemente la configuración correcta.

source: The other Tabs have the following different types of configuration options.
es: Las otras pestañas tienen los siguientes tipos de opciones de configuración.

source: Advanced Settings (MAC address override and MTU override)
es: Configuración avanzada (anulación de dirección MAC y anulación de MTU)

source: The "DHCP client" protocol is has few default configuration options. So the CLI configuration is very simple. Just connect to the Opuntia system via ssh. To access the Opuntia systems CLI interface please see the :ref:`Access-SSH` chapter of the manual.
es: El protocolo "cliente DHCP" tiene pocas opciones de configuración predeterminadas. Por lo que la configuración de la CLI es muy sencilla. Sólo tiene que conectarse al sistema Opuntia a través de ssh. Para acceder a la interfaz CLI de los sistemas Opuntia, consulte el capítulo :ref:`Acceso-SSH` del manual.

source: Below is a typical configuration for the "DHCP client" protocol on a *Wan* interface.
es: A continuación se muestra una configuración típica para el protocolo "cliente DHCP" en una interfaz *Wan*.

source: Since this such a simple configuration. Below is more complex configuration that overrides the hostname that the system will report to the upstream DHCP server.
es: Se trata de una configuración muy sencilla. A continuación se muestra una configuración más compleja que anula el nombre del anfitrión (hostname) que el sistema informará al servidor DHCP ascendente.

source: **CLI Configuraion Options**
es: **Opciones de configuración de la CLI**

source: Protocol 'dhcp'
es: Protocolo 'dhcp'

source: Hostname override (Defaults to current hostname)
es: Anulación del nombre del anfitrión (por defecto, el nombre del anfitrión actual)

source: DHCPv6 Client
es: Cliente DHCPv6

source: The "DHCPv6 client" protocol configures an interface to request IPv6 prefix delegation from a DHCPv6 server. This is the IPv6 equivlent "DHCP client" protocol with a few key differences. One of the major differences is that Opuntia will automatically configure IPv6 addresses using Stateless address autoconfiguration (SLAAC), stateless DHCPv6, stateful DHCPv6 or DHCPv6-PD if any of these options are available. Since a IPv6 host addresses is going to be configured automatically on interfaces, the role of DHCPv6 is often to recieve a IPv6 Prefix Delegation using DHCPv6-PD.
es: El protocolo "DHCPv6 client" configura una interfaz para solicitar la delegación de prefijos IPv6 a un servidor DHCPv6. Este es el protocolo "cliente DHCP" equivalente a IPv6 con algunas diferencias clave. Una de las principales diferencias es que Opuntia configurará automáticamente las direcciones IPv6 utilizando la configuración automática de direcciones sin estado (SLAAC), DHCPv6 sin estado, DHCPv6 con estado o DHCPv6-PD si alguna de estas opciones está disponible. Dado que las direcciones de anfitrión IPv6 se van a configurar automáticamente en las interfaces, la función de DHCPv6 suele ser la de recibir una delegación de prefijo IPv6 mediante DHCPv6-PD.

source: Dual Stack
es: Pila dual

source: Dual Stack operations with concurent IPv4 and IPv6 addresses assigned to the same physical networks is a very common configuration. Opuntia allows this type of configuration but since you can not run multiple protocols on a single Opuntia interface; Opuntia by default includes multiple Interfaces for upstream DHCP (*Wan*) and DHCPv6 (*Wan_6*). These interfaces allow the operator to configure protocol DHCP and DHCPv6 on the same physical Linux Interface. Care must be taken to be sure the same physical interface is referenced in both the *Wan* and *Wan_6* Opuntia Interfaces.
es: Las operaciones de doble pila con direcciones IPv4 e IPv6 concurrentes asignadas a las mismas redes físicas son una configuración muy común. Opuntia permite este tipo de configuración pero no se pueden ejecutar múltiples protocolos en una sola interfaz de Opuntia; Opuntia por defecto incluye múltiples Interfaces para DHCP ascendente (*Wan*) y DHCPv6 (*Wan_6*). Estas interfaces permiten al operador configurar el protocolo DHCP y DHCPv6 en la misma interfaz física de Linux. Hay que tener cuidado para asegurarse de que se hace referencia a la misma interfaz física tanto en la interfaz *Wan* como en la *Wan_6* de Opuntia.

source: The DHCPv6 protocol has two main configuration options. The "Request IPv6 address" mode and the "Request IPv6 Prefix length".
es: El protocolo DHCPv6 tiene dos opciones principales de configuración. El modo "Solicitar dirección IPv6" y "Solicitar longitud de prefijo IPv6".

source: The "Request IPv6 address" mode sets if we are attempting to request an IPv6 address on the interface. The default option is *try* which as the name implies tries to allocate an IPv6 address. This recommended setting.
es: El modo "Solicitar dirección IPv6" establece si estamos intentando solicitar una dirección IPv6 en la interfaz. La opción predeterminada es *try* (intentar) que, como su nombre indica, intenta asignar una dirección IPv6. Esta configuración recomendada.

source: The "Request IPv6 Prefix length" option specifies the length of requested IPv6 prefix delegation from the upstream router. The default value is *auto* and available options are *auto, no, 0-64*. The *auto* setting will accept the prefix length that the upstream router provides.
es: La opción "Solicitar longitud del prefijo IPv6" especifica la longitud de la delegación de prefijos IPv6 solicitada al router ascendente. El valor predeterminado es *auto* y las opciones disponibles son *auto, no, 0-64*. La configuración *auto* aceptará la longitud del prefijo que el router ascendente proporcione.

source: The *auto* setting will not request automatically request enough IPv6 prefix space for your configuration.
es: La configuración *auto* no solicitará automáticamente suficiente espacio de prefijo IPv6 para su configuración.

source: If you need more IPv6 space than your provider is allocating to the system by default; you can then specify the IPv6 Prefix length mannually. Normally providers will not allow prefix delegation requests larger than a /56. Adjust the requested IPv6 Prefix length as needed.
es: Si necesita más espacio IPv6 del que su proveedor asigna al sistema por defecto, puede especificar manualmente la longitud del prefijo IPv6. Normalmente, los proveedores no permitirán solicitudes de delegación de prefijos mayores que un /56. Ajuste la longitud del prefijo IPv6 solicitado según sea necesario.

source: The DHCPv6 protocol has few required options for a standard configuraion. Below is a common example configuraion.
es: El protocolo DHCPv6 tiene pocas opciones requeridas para una configuración estándar. A continuación se muestra un ejemplo de configuración común.

source: As you can see, minimal configuraion is necessary in most cases. Normally just reqaddress 'try' and the length of IPv6 prefix you need.
es: Como puede ver, en la mayoría de los casos solo es necesaria una configuración mínima. Normalmente sólo reqaddress 'try' y la longitud del prefijo IPv6 que se necesita.

source: Protocol 'dhcpv6'
es: Protocolo 'dhcpv6'

source: Mode
es: Modo

source: Request Mode (try, force, none)
es: Modo de solicitud (intentar, forzar, ninguno)

source: IPv6 Prefix length
es: Longitud del prefijo IPv6

source: IPv6 Prefix length (auto, no, 0-64)
es: Longitud del prefijo IPv6 (auto, no, 0-64)

source: IPv6 Prefix
es: Prefijo IPv6

source: User provided IPv6 for client delegation
es: IPv6 proporcionado por el usuario para la delegación de cliente

source: Boolean
es: Booleano

source: Default route (0 no, 1 yes, defaults to 1)
es: Ruta predeterminada (0 no, 1 sí, por defecto 1)

source: List of Ip addresses
es: Lista de direcciones IP

source: User provided Dns servers
es: Servidores Dns proporcionados por el usuario

source: Link Aggregation
es: Agregación de enlaces

source: *Unmanaged* is a special protocol type that is intended to allow a Linux Kernel interface to be listed as an Opuntia interface. There are two major use-cases for this protocol.
es: *Unmanaged* (sin gestión) es un tipo de protocolo especial previsto para permitir que una interfaz del núcleo (Kernel) de Linux aparezca como una interfaz de Opuntia. Este protocolo tiene dos usos principales.

source: First, This allows a interface to interact with the :ref:`Firewall-Zone-based` configuration. This can be useful if you want to include a Linux Kernel device in a Firewall zone that does not currently have any Opuntia protocol type.
es: En primer lugar, esto permite una interfaz para interactuar con la configuración :ref:`basado en zona de cortafuegos`. Esto puede ser útil si quiere incluir un dispositivo del Kernel Linux en una zona de cortafuegos que no tiene actualmente ningún tipo de protocolo Opuntia.

source: Second, If you have an interface that you configure using Linux tools. These can allow for more flexible configuraions but you still need Opuntia to be aware of the interface. A real world example of this is a VPN configuraion that uses policy routing, kernel routing tables and VLAN interfaces to provide a network that is by default routed over a VPN connection and does not allow any traffic from that network to ever exit the *normal* Internet connection.
es: En segundo lugar, si se cuenta con una interfaz que configura con herramientas de Linux. Estos pueden permitir configuraciones más flexibles, pero todavía se necesita que Opuntia esté al tanto de la interfaz. Un ejemplo del mundo real es una configuración VPN que utiliza políticas de enrutamiento, tablas de enrutamiento del kernel e interfaces VLAN para proporcionar una red que se enruta por defecto a través de una conexión VPN y no permite que ningún tráfico de esa red salga nunca de la conexión *normal* de Internet.

source: Wireless Interface Configuraion
es: Configuración de la interfaz inalámbrica

source: Wireless Interfaces in Opuntia
es: Interfaces inalámbricas en Opuntia

source: Opuntia has extensive support for Wireless networking. Depending on your hardware platform you may have 802.11n, 802.11ac or 802.11ax interfaces. These interfaces can be configured in several different operating modes.
es: Opuntia cuenta con un amplio soporte para redes inalámbricas. Dependiendo de su plataforma de hardware puede tener interfaces 802.11n, 802.11ac u 802.11ax. Estas interfaces pueden configurarse en varios modos de funcionamiento.

source: Access Point Configuraion
es: Configuración del punto de acceso

source: Introduction
es: Introducción

source: About Opuntia
es: Acerca de Opuntia

source: Opuntia is high performance routing and edge computing platform based on OpenWrt. It includes support for these major features.
es: Opuntia es una plataforma de enrutamiento (routing) y computación de borde (edge computing) de alto desempeño basada en OpenWRT. Incluye soporte para las siguientes características principales.

source: Support for IPv4/IPv6 connectivity
es: Soporte para conectividad IPv4/IPv6

source: VPN client and server support for Ipsec, OpenVpn and Wireguard
es: Soporte de cliente y servidor VPN para Ipsec, OpenVpn y Wireguard

source: Detailed usage statistics
es: Estadísticas de uso detalladas

source: Free Range Routing (Dynamic routing support for BGP, Ospf, Eigrp and IS-IS)
es: Enrutamiento de intervalo libre (soporte de enrutamiento dinámico para BGP, Ospf, Eigrp e IS-IS)

source: Automation via Ansible
es: Automatización mediante Ansible

source: Local Docker containers
es: Contenedores Docker locales

source: k3s (Light weight Kubernetes)
es: k3s (Kubernetes ligero)
