Repository: imagestream/opuntia-docs
Catalog: locales/*/LC_MESSAGES/Opuntia-manual.po
Languages: es

source: The first step is to add a new interface in the *System Preferences*-->*Network*. You can create a new Interface by clicking the + in the bottom left side of the interface menu. Set the "Interface Type" to *VPN* and the "VPN Type" to *L2TP over IPsec*. The "Service Name" can be set to your perfered name for the VPN. In our example we will set it to *L2TP-VPN*.
es: El primer paso es añadir una nueva interfaz en las *Preferencias del sistema*-->*Red*. Puede crear una nueva interfaz haciendo clic en el signo + de la parte inferior izquierda del menú de la interfaz. Fije el "Tipo de interfaz" a *VPN* y el "Tipo de VPN" a *L2TP sobre IPsec*. El "Nombre del Servicio" puede establecerse al nombre preferido para su VPN. En nuestro ejemplo lo fijaremos como *L2TP-VPN*.

source: The next step is to configure the basic "Server Address" and "Account Name" for the VPN. The "Server Address" will be the public IPv4 address that we set above; or in this example *203.0.113.1*. The "Account Name" will be *alice*.
es: El siguiente paso es configurar la "Dirección del servidor" básica y el "Nombre de la cuenta" para la VPN. La "Dirección del servidor" será la dirección IPv4 pública que establecimos anteriormente; o en este ejemplo *203.0.113.1*. El "Nombre de la cuenta" será *alice*.

source: The next two configuraion items can be set by pressing the "Authentication Settings..." button.
es: Los dos siguientes elementos de configuración se pueden establecer pulsando el botón "Configuración de la autenticación..." .

source: In the "Authentication Settings" dialog box, you will need to set the password for the user. In this example the password for *alice* is *47roses* and is entered into the "Password" field in the "User Authentication" section.
es: En el cuadro de diálogo "Configuración de la autenticación..." deberá establecer la contraseña del usuario. En este ejemplo, la contraseña de *alice* es *47roses* y se introduce en el campo "Contraseña" de la sección "Autenticación de usuario".

source: Next; set the *Pre-Shared Key* in the "Shared Secret" field in the "Machine Authentication" section. In our example this would be *3dTamd01m*. This concludes the minimum configuraion settings for a IPsec/L2TP VPN.
es: A continuación, establezca la *clave precompartida* en el campo "Secreto compartido" (Shared Secret) de la sección "Autenticación de máquina" (Machine Authentication). En nuestro ejemplo sería *3dTamd01m*. Esto concluye los ajustes mínimos de configuración para una VPN IPsec/L2TP.

source: **MacOS Big Sur Optional Settings**
es: **Configuración opcional de MacOS Big Sur**

source: MacOS IPsec/L2TP has two common configuraion options descibed below.
es: MacOS IPsec/L2TP tiene dos opciones de configuración comunes que se describen a continuación.

source: By default MacOS does not route all traffic through the IPsec/L2TP Vpn. This is a common requested configuraion. Access the advanced vpn configuration option. Then under the *Options* tab select "Send all traffic over VPN connection".
es: Por defecto, MacOS no enruta todo el tráfico a través de la Vpn IPsec/L2TP. Esta es una configuración solicitada con frecuencia. Acceda a la opción de configuración avanzada de vpn. A continuación, en la pestaña *Opciones* seleccione "Enviar todo el tráfico a través de la conexión VPN".

source: When routing all traffic over the VPN it is also necessary to define your DNS servers. Access the advanced vpn configuration option. Then under the *DNS* tab add a new DNS server by clicking the "+" button on the bottom left side of the dialog box. In this example we set the Google IPv4 public DNS servers.
es: Al enrutar todo el tráfico a través de la VPN también es necesario definir sus servidores DNS. Acceda a la opción de configuración avanzada de vpn. A continuación, en la pestaña *DNS* añada un nuevo servidor DNS haciendo clic en el botón "+" en la parte inferior izquierda del cuadro de diálogo. En este ejemplo establecemos los servidores DNS públicos IPv4 de Google.

source: Wired Ethernet Interface Configuraion
es: Configuración de la interfaz Ethernet alámbrica

source: Interfaces in Opuntia
es: Interfaces en Opuntia

source: A familiar concept in computer networking is that of the "Interface". An "Interface" is a software construct that allows computer systems to interact with networks. An interface can represent a physical device like an Ethernet port. It can also represent virtual devices like a Loopback device.
es: Un concepto familiar en las redes informáticas es el de "interfaz". Una "interfaz" es una construcción de software que permite a los sistemas informáticos interactuar con las redes. Una interfaz puede representar un dispositivo físico como un puerto Ethernet. También puede representar dispositivos virtuales como un dispositivo de bucle de retorno.

source: Opuntia extends this concept slightly. Opuntia is based on a Linux operating system and the base Linux system can have many different network Interfaces. An Opuntia interface can be mapped to a Linux Interface. And The Opuntia Interface can also be a group of bridged Linux Interfaces. By bridging multiple interfaces together they all share the same network IP / IPv6 address space. And any host connected to any of these interfaces can communicate directly.
es: Opuntia amplía ligeramente este concepto. Opuntia se basa en un sistema operativo Linux y el sistema Linux base puede tener muchas interfaces de red diferentes. Una interfaz Opuntia puede ser mapeada a una interfaz Linux. Y la Interfaz Opuntia también puede ser un grupo de Interfaces Linux puenteadas. Al unir varias interfaces, todas comparten el mismo espacio de direcciones IP / IPv6 de la red. Y cualquier anfitrión (host) conectado a cualquiera de estas interfaces puede comunicarse directamente.

source: For example a common configuration is to have a *Lan* and *Wan* network interface. The *Wan* interface is mapped to an Linux interface that is connected to an upstream Internet provider. The *Lan* interface is often a brige of all of the other Ethernet interfaces on the router. This replicates a common CPE (Customer premises equipment) configuration where one interface is used to connect to an Internet provider and all other interfaces in the system share a network.
es: Por ejemplo, una configuración común es tener una interfaz de red *Lan* y *Wan*. La interfaz *Wan* se asigna a una interfaz de Linux que está conectada a un proveedor de Internet ascendente (upstream). La interfaz *Lan* suele ser un conjunto de todas las demás interfaces Ethernet del router. Esto replica una configuración común de equipo en instalaciones del consumidor (CPE, por sus siglas en inglés, Customer premises equipment) en la que se utiliza una interfaz para conectarse a un proveedor de Internet y todas las demás interfaces del sistema comparten una red.

source: This relationship between an interface in Opuntia and the base Linux networking interface is a key concept that is also needed to understand how to configure VLAN tags on Ethernet devices. This will be covered in detail in the VLAN section. But as a brief introduction it is the mapping of the Opuntia interface to the Linux networking interface that controls if traffic leaving the system will be VLAN tagged.
es: Esta relación entre una interfaz en Opuntia y la interfaz de red base de Linux es un concepto clave que también es necesario para entender cómo configurar las etiquetas VLAN en los dispositivos Ethernet. Esto se tratará en detalle en la sección de VLAN. Pero como breve introducción es el mapeo de la interfaz de Opuntia a la interfaz de red de Linux el que controla si el tráfico que sale del sistema será etiquetado VLAN.

source: So Opuntia networking interfaces are either a 1:1, 1:many or even a many:1 mapping with respect to the Linux networking interfaces. The Opuntia interfaces have flexible naming making it easy to understand the purpose of an interface; for example name of *Wan* vs a Linux device name of *enp97s0f0*. They are also used to define membership of a firewall zone.
es: De tal manera, las interfaces de red de Opuntia son un mapeo 1:1, 1:muchos o incluso muchos:1 con respecto a las interfaces de red de Linux. Las interfaces de Opuntia tienen una nomenclatura flexible que facilita la comprensión del propósito de una interfaz; por ejemplo, el nombre de *Wan* frente a un nombre de dispositivo Linux de *enp97s0f0*. También se utilizan para definir la pertenencia a una zona de cortafuegos.

source: In Opuntia each interface has an associated network protocol. Going back to the common example of CPE device. The *Wan* interface normally configured with protocol "DHCP Client". This configuration results in the system making an IPv4 DHCP request on the physical interface connected to the ISP. If IPv6 DHCP is required it's common to have a *Wan_6* interface also configured. This Opuntia interface shares the same physical interface with the *Wan* interface. But it has a different network protocol configuration in this case "DHCPv6 client". The *Lan* interface would have a "Static address" configured. This static address will often be a private `RFC 1918 address <https://tools.ietf.org/html/rfc1918>`_.
es: En Opuntia cada interfaz tiene un protocolo de red asociado. Volviendo al ejemplo común del dispositivo CPE. La interfaz *Wan* normalmente está configurada con el protocolo "Cliente DHCP". Esta configuración hace que el sistema realice una solicitud de DHCP IPv4 en la interfaz física conectada al ISP. Si se requiere IPv6 DHCP es común tener una interfaz *Wan_6* también configurada. Esta interfaz Opuntia comparte la misma interfaz física con la interfaz *Wan*. Pero en este caso tiene una configuración de protocolo de red diferente "cliente DHCPv6". La interfaz *Lan* tendría configurada una "dirección estática". Esta dirección estática suele ser una dirección privada `RFC 1918 <https://tools.ietf.org/html/rfc1918>`_.

source: Below is the Network Interface page from a router configured in this scenario. You will see a pair of *Wan* and *Wan_6* interfaces. These interfaces have protocol "DHCP" and "DHCPv6" configured. In this we are getting ip address 192.168.79.14/24 on the *Wan* interface and 2605:6000:62e0:400::1fa/128 on the *Wan_6* interface. Both the *Wan* and *Wan_6* interface are sharing the same Linux device in this case *eth0*. The *Lan* interface is configured with a static IPv4 address of 10.10.199.1/24 and the IPv6 subsystem has assigned a network range of 2605:6000:62e0:410::1/62 to this interface. The color code of the devices tell you which firewall zone applies to the interface.
es: A continuación se muestra la página de la interfaz de red de un router configurado en este escenario. Puede ver un par de interfaces *Wan* y *Wan_6*. Estas interfaces tienen configurado el protocolo "DHCP" y "DHCPv6". En esto, obtendremos la dirección ip 192.168.79.14/24 en la interfaz *Wan* y 2605:6000:62e0:400::1fa/128 en la interfaz *Wan_6*. Tanto la interfaz *Wan* como *Wan_6* están compartiendo el mismo dispositivo Linux, en este caso *eth0*. La interfaz *Lan* está configurada con una dirección IPv4 estática de 10.10.199.1/24 y el subsistema IPv6 ha asignado un intervalo de red de 2605:6000:62e0:410::1/62 a esta interfaz. El código de color de los dispositivos le indica qué zona de cortafuegos se aplica a la interfaz.

source: To demonstrate what is happening at the Linux level here is the configuration in the base operating system. The Linux *eth0* interface has both the DHCP assigned IPv4 address and the DHCPv6 assigned IPv6 address bound.
es: Para demostrar lo que ocurre a nivel de Linux aquí está la configuración en el sistema operativo base. La interfaz Linux *eth0* tiene tanto la dirección IPv4 asignada por DHCP como la dirección IPv6 asignada por DHCPv6.

source: Understanding how Opuntia is interacting with the Linux networking stack is important if you plan to use custom iptables firewall rules, monitoring and interacting in the CLI. The Linux networking stack is unaware of Opuntia device names. So attempts to use the Opuntia device names from the CLI will fail.
es: Entender cómo interactúa Opuntia con la pila de redes de Linux es importante si planea usar reglas de cortafuegos iptables personalizadas, para monitorear e interactuar en la CLI. La pila de redes de Linux no conoce los nombres de los dispositivos de Opuntia. Por lo tanto, los intentos de utilizar los nombres de los dispositivos de Opuntia desde la CLI fallarán.

source: Vlan Configuraion
es: Configuración de la Vlan

source: To configure VLAN interfaces in Opuntia is a simple process but slightly non-intuitive. In the above section we talked about how Opuntia interces are not necessarily the same as the Linux Interfaces. The Linux interface is what controlls if a device adds a VLAN tag to outgoing Ethernet frames. This is done by simply setting the Linux interface name ending with .#vlan-id#. So for example; if you wanted to configure the physical interface eth1 to use VLAN ID 100 you would create a interface named eth0.100. To do this you will have to create a new interface then set a custom device name.
es: Configurar las interfaces VLAN en Opuntia es un proceso sencillo pero poco intuitivo. En la sección anterior hemos hablado de que las interfaces de Opuntia no son necesariamente las mismas que las de Linux. La interfaz Linux es la que controla si un dispositivo añade una etiqueta VLAN a las tramas Ethernet salientes. Esto se hace simplemente configurando el nombre de la interfaz Linux que termina con .#vlan-id#. Así, por ejemplo, si se quiere configurar la interfaz física eth1 para utilizar la VLAN ID 100, se crearía una interfaz llamada eth0.100. Para ello tendrá que crear una nueva interfaz y luego establecer un nombre de dispositivo personalizado.

source: The following screenshots show this operation. First you will create a new Interface. In this example we are using protocol static. The physical interface will start as *unspecificed* we select the dropdown box and type a custom Interface name into the box. In this case since we want the new Interface to be VLAN ID 100 on the physical eth1 interface we type **eth1.100**.
es: Las siguientes capturas de pantalla muestran esta operación. Primero creará una nueva interfaz. En este ejemplo estamos utilizando el protocolo estático. La interfaz física se iniciará como *sin especificar*; seleccionamos el cuadro desplegable y escribimos un nombre de interfaz personalizado en el cuadro. En este caso, como queremos que la nueva interfaz sea la VLAN ID 100 en la interfaz física eth1, escribimos **eth1.100**.

source: Once we have input the custom interface name, hit enter and the Interface dropdown box will fill in the name correctly.
es: Una vez que hayamos introducido el nombre de la interfaz personalizada, pulsamos enter y el cuadro desplegable de la interfaz rellenará el nombre correctamente.

source: This is all that is required to configure a VLAN tagged Opuntia Interface. All traffic transmited on this interface will leave the system with VLAN tag 100 set. All Ethernet frames recieved on eth1 with VLAN tag 100 will be recieved on this interface.
es: Esto es todo lo que se necesita para configurar una interfaz Opuntia etiquetada VLAN. Todo el tráfico transmitido por esta interfaz saldrá del sistema con la etiqueta VLAN 100 establecida. Todas las tramas Ethernet recibidas en eth1 con etiqueta VLAN 100 serán recibidas en esta interfaz.

source: This is what Opuntia will show when the interface is finished being configured. Note the interface name listed as **eth1.100**.
es: Esto es lo que mostrará Opuntia cuando se termine de configurar la interfaz. Observe que el nombre de la interfaz aparece como **eth1.100**.

source: Opuntia also supports IEEE 802.1ad also known as provider bridging or QinQ VLAN tagging. This allows for *Stacking* VLAN taggs. The configuration is exactly the same as with normal VLAN configuration but you add an extra VLAN tag. In the following example we are configuring a QinQ interface that has a provider service tag (*S-TAG*) of 100 and a customer tag (*C-TAG*) of 20. Follow directions to configure VLAN interfaces and input "eth1.100.20" as the device name.
es: Opuntia también es compatible con IEEE 802.1ad, conocido también como proveedor puente o etiquetado VLAN QinQ. Esto permite el *apilamiento* de etiquetas VLAN. La configuración es exactamente la misma que con la configuración normal de la VLAN, pero se añade una etiqueta VLAN adicional. En el siguiente ejemplo estamos configurando una interfaz QinQ que tiene una etiqueta de servicio de proveedor (*S-TAG*) de 100 y una etiqueta de cliente (*C-TAG*) de 20. Siga las instrucciones para configurar las interfaces VLAN e introduzca "eth1.100.20" como nombre del dispositivo.

source: Here is what Opuntia will show after this is configured. Note the device name listed as **eth1.100.20**.
es: He aquí lo que Opuntia mostrará después de configurarlo. Observe que el nombre del dispositivo aparece como **eth1.100.20**.

source: Here is what this looks like at the Linux interface level.
es: Así es como luce en el nivel de la interfaz de Linux.

source: Protocol Configuraion
es: Configuración del protocolo

source: Opuntia supports several different interface protocols. This protocol configuration setting configures the main operating mode of the interface. Below are the most commonly used protocol types.
es: Opuntia es compatible con varios protocolos de interfaz diferentes. Este ajuste en la configuración del protocolo configura el modo de funcionamiento principal de la interfaz. A continuación se indican los tipos de protocolo más utilizados.

source: Static addresses
es: Direcciones estáticas

source: DHCP client
es: Cliente DHCP

source: DHCPv6 client
es: Cliente DHCPv6

source: Unmanaged
es: No gestionado

source: Link Aggregation (IEEE 802.3ad)
es: Agregación de enlaces (IEEE 802.3ad)

source: We will cover each of these protocol types in detail. But there are other types that are supported but we are not documenting at this time due to lack of real world useage. If you believe that you are required to use one of these protocols and you are having difficulty plese contact ImageStream support at *support@imagestream.com*.
es: Vamos a cubrir cada uno de estos tipos de protocolo en detalle. Sin embargo, hay otros tipos que son compatibles pero que no estamos documentando en este momento debido a la falta de uso en el mundo real. Si considera que debe utilizar uno de estos protocolos y tiene dificultades, póngase en contacto con el servicio de asistencia de ImageStream en *support@imagestream.com*.

source: To change the protocol setting of an interface first navigate the the Interface page in the Web GUI.
es: Para cambiar la configuración del protocolo de una interfaz, primero navegue a la página de la Interfaz en la GUI Web.

source: There you will see a listing of all of the interfaces currently configured in the system. Below is an example of we are showing the interfaces page from the *Wan and Lan* example we used in talking about Opuntia interfaces.
es: Allí verá un listado de todas las interfaces actualmente configuradas en el sistema. A continuación mostramos la página de interfaces del ejemplo de *Wan y Lan* que utilizamos al hablar de las interfaces de Opuntia.

source: As you can see we have three defined interfaces; Wan, Wan_6 and Lan. This example has protocol DHCP configured on the *Wan* interface, DHCPv6 on the *Wan_6* interface and Static address protocol on the *Lan* interface.
es: Como puede ver tenemos tres interfaces definidas; Wan, Wan_6 y Lan. Este ejemplo tiene configurado el protocolo DHCP en la interfaz *Wan*, DHCPv6 en la interfaz *Wan_6* y el protocolo de dirección estática en la interfaz *Lan*.

source: To change an interface to a different protocol click the "Edit" button for that interface. Then select the drop down box labled "Protocol".
es: Para cambiar una interfaz a un protocolo diferente, haga clic en el botón "Edit" (editar) de esa interfaz. A continuación, seleccione el cuadro desplegable denominado "Protocolo".

source: You can select your new protocol and you will have to *Save & Apply* the change in the Interfaces page before you will be able to configure settings for the newly selected protocol.
es: Puede seleccionar su nuevo protocolo y tendrá que *Guardar y Aplicar* el cambio en la página de Interfaces antes de poder configurar los ajustes para el nuevo protocolo seleccionado.

source: The "Static Protocol" is allows for setting IPv4/IPv6 addresses and address ranges manually on an interface. This one of the most common configuration scenarios. This protocol is frequently used with *internal* RFC 1918 addresses and for upstream Internet connections. The "Static Protocol" also allows the configuration of DHCP/DHCPv6 servers. So this protocol type is almost universally used on at least one interface in any deployment.
es: El "Protocolo estático" permite configurar manualmente direcciones IPv4/IPv6 e intervalos de direcciones en una interfaz. Este es uno de los escenarios de configuración más comunes. Este protocolo se utiliza con frecuencia con las direcciones *internas* RFC 1918 y para las conexiones ascendentes de Internet. El "Protocolo Estático" también permite la configuración de servidores DHCP/DHCPv6. Por lo tanto, este tipo de protocolo se utiliza casi de manera universal en al menos una interfaz en cualquier implementación.

source: The interface configuration is accessed by navigating to the Network interfaces page.
es: Se accede a la configuración de la interfaz navegando a la página de interfaces de red.

source: Once you have navigated to the interfaces page, you can click on the "Edit" button on the interface to see the "General Settings" tab.
es: Una vez que haya navegado a la página de interfaces, puede hacer clic en el botón "Edit" de la interfaz para ver la pestaña "Configuración general".

source: In this screenshot you see the "General Settings" tab. This tab allows for the setting of static IPv4 and IPv6 addresses.
es: En esta captura de pantalla se ve la pestaña "Ajustes generales". Esta pestaña permite configurar direcciones IPv4 e IPv6 estáticas.

source: General Settings (IPv4/IPv6 address, netmask and Custom DNS servers)
es: Configuración general (dirección IPv4/IPv6, máscara de red y servidores DNS personalizados)

source: Advanced Settings (Built-in IPv6, MAC address override and MTU override)
es: Configuración avanzada (IPv6 incorporado, anulación de dirección MAC y anulación de MTU)

source: Physical Settings (Bridging configuration and Interface Selection)
es: Ajustes físicos (configuración de puentes y selección de interfaces)

source: Firewall Settings (Firewall zone assigned to the interface)
es: Configuración del cortafuegos (zona de cortafuegos asignada a la interfaz)

source: DHCP Server (DHCP Settings and IPv6 specific configuration)
es: Servidor DHCP (configuración de DHCP y configuración específica de IPv6)

source: IPv4 addresses are the most commonly configured static addresses. When setting IPv4 address you are given the option of inputing the address and netmask separately or to use the CIDR list notation. ImageStream recommends using CIDR syntax as it's more human readable and less likely to result is the incorrect configuration of address ranges.
es: Las direcciones IPv4 son las direcciones estáticas más frecuentemente configuradas. Al configurar la dirección IPv4 tiene la opción de introducir la dirección y la máscara de red por separado o de utilizar la notación de lista CIDR. ImageStream recomienda utilizar la sintaxis CIDR, ya que es más legible y es menos probable que se produzca una configuración incorrecta de los intervalos de direcciones.
