Repository: imagestream/opuntia-docs
Catalog: locales/*/LC_MESSAGES/Opuntia-manual.po
Languages: es

source: But if your network design is simple with only a single Internet gateway or no Multi-path Routing, the *Software flow Offloading* can greatly reduce the cpu load at a given throughput.
es: Pero si el diseño de su red es sencillo, con una sola puerta de enlace de Internet o sin enrutamiento multitrayectoria, la *Software flow Offloading* puede reducir en gran medida la carga de la cpu a un rendimiento determinado.

source: *Hardware flow Offloading* is only supported on specific hardware platforms check your QuickStart Guide to see if your platform supports this feature.
es: La descarga de flujo de hardware, *Hardware flow Offloading*, sólo es compatible en determinadas plataformas de hardware. Verifique su Guía de inicio rápido para comprobar si su plataforma admite esta función.

source: This section descibes the mapping of relationships of the firewall zones to default packet policy in these zones. Here is a detailed screenshot of the zones section.
es: Esta sección describe el mapeo de las relaciones de las zonas del cortafuegos con la política de paquetes predeterminadas en estas zonas. Aquí hay una captura de pantalla detallada de la sección de zonas.

source: Here you see the two default zones that are configured in Opuntia. The *Wan* and *Management* zones.
es: Aquí puede ver las dos zonas predeterminadas que están configuradas en Opuntia. Las zonas *Wan* y *Gestión*.

source: Looking at the *Management* zone, You can see the arrow indicating the direction of the traffic. From the *Management* zone to the *Wan* zone.
es: Analizando en la zona de *Gestión*, puede ver la flecha que indica el sentido del tráfico. De la zona de *Gestión* a la zona *Wan*.

source: Limiting External access
es: Limitación del acceso externo

source: By default Opuntia is permisive with access to local services like the Web GUI and ssh login. While very useful for allowing administrator access to the equipment; this can be a security risk. This section of the manual will detail how to remove some of the default firewall rules that allow access to these services from remote.
es: Por defecto, Opuntia es permisivo con el acceso a los servicios locales como la interfaz gráfica de usuario (GUI) web y el inicio de sesión ssh. Aunque es muy útil para permitir el acceso del administrador al equipo, esto puede ser un riesgo para la seguridad. En esta sección del manual se detallará cómo eliminar algunas de las reglas predeterminadas del cortafuegos que permiten el acceso a estos servicios de forma remota.

source: This image is from https://commons.wikimedia.org/wiki/File:Netfilter-packet-flow.svg This is a Common Creatives work that is based on the Joshua Snyders (Author of this manual) work.
es: Esta imagen es de https://commons.wikimedia.org/wiki/File:Netfilter-packet-flow.svg Es una obra de Common Creatives que se basa en la obra de Joshua Snyders (autor de este manual).

source: Operating System Managment
es: Gestión del sistema operativo

source: Firmware file format
es: Formato de archivo del firmware

source: The firmware has a standard filename format to help identify the correct firmware image for a specifc hardware platform.
es: El firmware tiene un formato de nombre de archivo estándar para ayudar a identificar la imagen de firmware correcta para una plataforma de hardware específica.

source: <Os-name>-<Model name>-<Hardware version>-<Major Release>-<release tag>-<factory/sysupgrade>.img
es: <nombre-SO>-<nombre del Modelo><versión Hardware><Versión principal>-<release tag>-<factory/sysupgrade>.img

source: For example: opuntia-EV1000-v4-4.8.17-r51455-sysupgrade.bin is an Opuntia image for the EV1000 hardware version 4. The major OS release is 4.8.17 and it has a release tag of r51455. This is a system upgrade image that if installed will upgrate the OS on the EV1000 to 4.8.17.
es: Por ejemplo: opuntia-EV1000-v4-4.8.17-r51455-sysupgrade.bin es una imagen de Opuntia para la versión 4 del hardware de EV1000. La versión principal del SO es la 4.8.17 y tiene la etiqueta de versión r51455. Esta es una imagen de actualización del sistema que, si se instala, actualizará el SO del EV1000 a la versión 4.8.17.

source: Opuntia firmware is available at the following website. We
es: El firmware de Opuntia está disponible en el siguiente sitio web. Nosotros

source: `Opuntia Firmware Download Site <http://router-updates.imagestream.com/opuntia/>`_
es: `Sitio de descarga del firmware de Opuntia <http://router-updates.imagestream.com/opuntia/>`_

source: Take care when downloading firmware: the firmware image must match your hardware platform and device type. Failure to do so will result in sadness and a bricked device.
es: Tenga cuidado al descargar el firmware: la imagen del firmware debe coincidir con su plataforma de hardware y el tipo de dispositivo. La inobservancia de ello dará como resultado un dispositivo inservible junto con la tristeza correspondiente.

source: Upgrading the OS
es: Actualización del SO

source: Opuntia supports several different hardware platforms, at the current time Opuntia nativily runs on x86, Arm64 and Mips systems. Please consult your hardware quickstart guide.
es: Opuntia es compatible con diferentes plataformas de hardware. Actualmente Opuntia funciona de forma nativa en sistemas x86, Arm64 y Mips. Consulte la guía de inicio rápido de su hardware.

source: Web GUI
es: Interfaz gráfica de usuario web (GUI Web)

source: Upgrading the Firmware on an Opuntia system is easy from the Web GUI. You will be given the option to save the current configuration after the firmware update. This is the default option.
es: La actualización del Firmware en un sistema Opuntia es fácil desde la GUI web. Se le dará la opción de guardar la configuración actual después de la actualización del firmware. Esta es la opción predeterminada.

source: When upgrading between major versions, configuration settings are not guaranteed to be compatible.
es: Al actualizar entre versiones principales, no se garantiza que los ajustes de configuración sean compatibles.

source: Navigate to the "Backup/Flash Firmware" page to get started on the upgrade process.
es: Navegue a la página "Backup/Flash Firmware" para comenzar el proceso de actualización.

source: Verify that you have the correct firmware file for your hardware platform. Then click the "Flash image" button to bring up a local file browser. Then select to the correct firmware file. This file will be uploaded to the system. After the upload is finished you will see the "flash confirmation dialog box". You will see the firmware size, MD5 and SHA256 hash values.
es: Compruebe que tiene el archivo de firmware correcto para su plataforma de hardware. A continuación, haga clic en el botón "Flash image" para que aparezca un explorador de archivos local. A continuación, seleccione el archivo de firmware correcto. Este archivo se cargará en el sistema. Una vez finalizada la carga, verá el "cuadro de diálogo de confirmación flash". Verá el tamaño del firmware y los valores hash MD5 y SHA256.

source: The firmware update can change the ip address of the system so you may have to reconnect to a different url.
es: La actualización del firmware puede cambiar la dirección ip del sistema por lo que es posible que tenga que volver a conectarse a una url diferente.

source: After clicking contine the system will begin flashing.
es: Después de hacer clic en continuar el indicador del sistema comenzará a parpadear.

source: DO NOT POWER off the system while the firmware upgrade process is running. Failure to do so may result in the system being unable to boot.
es: NO APAGUE el sistema mientras el proceso de actualización del firmware esté en marcha. La inobservancia de lo anterior puede resultar en que el sistema sea incapaz de arrancar.

source: Upgrading the firmware from the command line is not difficult. The major complication is getting the firmware to the device and insuring that you do not fill the limited space that is available on the filesystem.
es: Actualizar el firmware desde la línea de comandos no es difícil. La mayor complicación es llevar el firmware al dispositivo y asegurarse de no llenar el limitado espacio disponible en el sistema de archivos.

source: When uploading
es: Al cargar

source: VPN Configuraion
es: Configuración VPN

source: Opuntia VPN
es: VPN de Opuntia

source: Opuntia supports a wide variety of VPN technologies. The main options for Opuntia are the following Vpn types.
es: Opuntia es compatible con una amplia variedad de tecnologías de VPN. Las principales opciones para Opuntia son los siguientes tipos de Vpn.

source: We will detail each option in a section of this chapter of the Opuntia manual.
es: Detallaremos cada opción en una sección del presente capítulo del manual de Opuntia.

source: WireGuard is a simple and fast modern VPN solution that uses state of the art cyptography. It's designed to be replace IPsec VPN's while simpler to configure. And it is also more performant than OpenVpn. The offical WireGuard site lists the following as the major advantages of WireGuard.
es: WireGuard es una solución VPN moderna, sencilla y rápida que utiliza la criptografía más avanzada. Está diseñado para reemplazar a las VPN IPsec, pero es más sencillo de configurar. Y también es más eficaz que OpenVpn. El sitio oficial de WireGuard enumera las siguientes ventajas principales de WireGuard.

source: Simple & Easy to use
es: Sencillo y fácil de usar

source: Cryptographically Sound
es: Criptográficamente sólido

source: Minimal Attack Surface
es: Superficie de ataque mínima

source: High Performance
es: Alto desempeño

source: WireGuard is also very tolerent of network changes. For example if a client device is connected to a Opuntia system using WireGuard and the client devices Public Ip Address changes due to roaming to a new network; the WireGuard vpn tunnel can be reestablished in just miliseconds. This allows for seemless operation in changing network conditions.
es: WireGuard también es muy tolerante a los cambios en la red. Por ejemplo, si un dispositivo cliente está conectado a un sistema Opuntia utilizando WireGuard y la dirección IP pública de los dispositivos cliente cambia debido a la itinerancia a una nueva red; el túnel vpn de WireGuard puede ser restablecido en sólo milisegundos. Esto permite un funcionamiento sin problemas en condiciones de red cambiantes.

source: For these reasons WireGuard is the perfered VPN solution for Opuntia.
es: Por estas razones WireGuard es la solución VPN preferida para Opuntia.

source: Generate a key pair
es: Generar un par de claves

source: WireGuard requires a public and private key pair. And all connectinng devices will need to know the Public key for the WireGuard interface. And there must be a unique private key for each WireGuard interface. It's possible to generate these keys on other systems and then use those keys on an Opuntia system. But currently there is no built in option to generate a new key pair from the Luci Web GUI. This functionality will be added in the future.
es: WireGuard requiere un par de claves públicas y privadas. Y todos los dispositivos que se conecten necesitarán conocer la clave pública de la interfaz de WireGuard. Debe haber una clave privada única para cada interfaz de WireGuard. Es posible generar estas claves en otros sistemas y luego utilizarlas en un sistema Opuntia. Pero actualmente no hay una opción integrada para generar un nuevo par de claves desde la GUI Web de Luci. Esta funcionalidad se añadirá en el futuro.

source: To generate a new WireGuard key pair you will to access the Bash CLI please see the :ref:`Access-SSH` chapter of the manual. Once you have an active CLI shell, you can run the following commands.
es: Para generar un nuevo par de claves de WireGuard tendrá que acceder a la CLI de Bash; le sugerimos ver el capítulo :ref:`Acceso-SSH` del manual. Una vez que tenga una consola CLI activa, puede ejecutar los siguientes comandos.

source: The first two commands create a /etc/wireguard driectory. Only the last line actually creates the public and private key. The resulting keys will be Base64 encoded. For the rest of this chapter we will be using the following example keys. ::
es: Los dos primeros comandos crean un directorio /etc/wireguard. Sólo la última línea crea efectivamente la clave pública y privada. Las claves resultantes estarán codificadas en Base64. Para el resto de este capítulo utilizaremos las siguientes claves de ejemplo. ::

source: To function, a WireGuard VPN requires a WireGuard Interface and Peer configuraion for each device connected to the VPN.
es: Para funcionar, una VPN de WireGuard requiere una interfaz de WireGuard y una configuración de pares para cada dispositivo conectado a la VPN.

source: To begin creating a new WireGuard interface first navigate to the Network interfaces page.
es: Para comenzar a crear una nueva interfaz de WireGuard primero navegue a la página de interfaces de la red.

source: Main Menu - *Network --> Interfaces*
es: Menú principal - *Red --> Interfaces*

source: Then click on the "Add new interface" button.
es: Luego, haga clic en el botón "Añadir nueva interfaz".

source: Name your new Interface and select protocol *WireGuard VPN*.
es: Dé nombre su nueva interfaz y seleccione el protocolo *WireGuard VPN*.

source: You will then see the WireGuard interface configuraion settings. Start the configuraion by adding the privatekey for this WireGuard interface. The privatekey will be only be used in the interface configuraion. To allow
es: A continuación, verá los ajustes de configuración de la interfaz de WireGuard. Inicie la configuración añadiendo la clave privada para esta interfaz de WireGuard. La clave privada sólo se utilizará en la configuración de la interfaz. Para permitir

source: WireGuard will use a default listen port of 51820. If you have multiple WireGuard interfaces you will have to specify different udp ports for each interface.
es: WireGuard utilizará un puerto de escucha predeterminado de 51820. Si tiene varias interfaces de WireGuard tendrá que especificar diferentes puertos udp para cada interfaz.

source: While technically not required; we recommend that you set an Ip address on the WireGuard interface.
es: Aunque técnicamente no es necesario, le recomendamos que establezca una dirección IP en la interfaz del WireGuard.

source: Peer Configuraion
es: Configuración de pares

source: IPsec/L2TP is a widely deployed VPN technlogy since client support is built into most operating systems. It features the strong security of IPsec with the addition of the the L2TP tunneling protocol. This does add complexity to the already feature rich IPsec vpn. This allows for a username and password to be asigned each user. This is also sometimes considered a multi-factor VPN (Username/Password and PSK) which can fullfil configuraion requirements in some remote security enviorments.
es: IPsec/L2TP es una tecnología VPN muy extendida, ya que el soporte de clientes está integrado en la mayoría de los sistemas operativos. Cuenta con una seguridad robusta de IPsec con la adición del protocolo de túnel L2TP. Esto añade complejidad a la ya enriquecida vpn IPsec. Esto permite asignar un nombre de usuario y una contraseña a cada usuario. A veces también se considera una VPN multifactor (nombre de usuario/contraseña y PSK) que puede cumplir los requisitos de configuración en algunos entornos de seguridad remotos.

source: Currently as of Opuntia version 4.8.17 this configuration has not recieved a Web GUI configuration menu. We will outline CLI method to configure this VPN type. To successfully configure IPsec/L2TP you will need the following items.
es: Actualmente, a partir de la versión 4.8.17 de Opuntia, esta configuración no ha recibido un menú de configuración de la GUI Web. Vamos a describir el método de CLI para configurar este tipo de VPN. Para configurar correctamente IPsec/L2TP necesitará los siguientes elementos.

source: Public IP Address
es: Dirección IP pública

source: Pre-Shared Key
es: Clave precompartida

source: Username for each user
es: Nombre de usuario para cada usuario

source: Password for each user
es: Contraseña para cada usuario

source: Since the default options for IPsec/L2TP is to automatically negotiate most of the options for this type of VPN the total configuration is not that complex. There are four main files that need to be edited.
es: Dado que las opciones predeterminadas para IPsec/L2TP es negociar automáticamente la mayoría de las opciones para este tipo de VPN, la configuración total no es tan compleja. Hay cuatro archivos principales que deben ser editados.

source: The first file that must be edited is /etc/ipsec.secrets.
es: El primer archivo que debe ser editado es /etc/ipsec.secrets.

source: This file configures your Public IP address and the Pre-Shared Key. In this example the 203.0.113.1 address is your public IP address that the clients will be connecting to. The "%any" allows any Ip Address to connect to this VPN. This can be used to limit connecting clients but is generally set to "%any" in most vpn configurations.
es: Este archivo configura su dirección IP pública y la clave precompartida. En este ejemplo, la dirección 203.0.113.1 es su dirección IP pública a la que se conectarán los clientes. El "%any" permite que cualquier dirección IP se conecte a esta VPN. Se puede utilizar para limitar los clientes que se conectan, pero generalmente se establece en "%any" en la mayoría de las configuraciones de VPN.

source: The Pre-Shared Key in this example is a short text string *3dTamd01m* this string can be any valid ASCII string.
es: La clave precompartida en este ejemplo es una cadena de texto corta *3dTamd01m*. Esta cadena puede ser cualquier cadena ASCII válida.

source: The second file is the main IPsec configuraion file /etc/ipsec.conf
es: El segundo archivo es el archivo principal de configuración de IPsec /etc/ipsec.conf

source: Here you see the IPsec Pre-Shared Key configuraion named *vpnserver*. This defines the IPsec parmeters for the connection. Notable options specified are *authby=secret*, *left=203.0.113.1*, *right=%any* and both of the right and left protocol ports.
es: Aquí puede ver la configuración de la clave precompartida IPsec denominada *vpnserver*. Este define los parámetros IPsec para la conexión. Las opciones especificadas son *authby=secret*, *left=203.0.113.1*, *right=%any* y ambos puertos de protocolo derecho (right) e izquierdo (left).

source: The *authby* setting tells the IPsec subsystem to use the Pre-Shared Key that we set in the /etc/ipsec.secrets file. The *left* setting defines the Public IP Address that the system is using and this *right* allows any client to connect. The two protocolport options specify that only UDP port 1701 will be encrypted using IPsec.
es: La configuración *authby* le dice al subsistema IPsec que use la clave precompartida que establecimos en el archivo /etc/ipsec.secrets. La configuración *izquierda* define la dirección IP pública que el sistema está utilizando y esta *derecha* permite que cualquier cliente se conecte. Las dos opciones de protocolport especifican que sólo el puerto UDP 1701 será encriptado usando IPsec.

source: This ends the IPsec configuraion that needs to be configured.
es: Esto termina la configuración de IPsec que necesita configurarse.

source: The next two files deal with the L2TP configuraion. First up is the /etc/xl2tpd/xl2tpd.conf configuraion file.
es: Los dos siguientes archivos se ocupan de la configuración de L2TP. El primero es el archivo de configuración /etc/xl2tpd/xl2tpd.conf.

source: This is the L2TP server configuraion file. Here you see the Public IP Address referenced in the global *listen-addr* setting. The default lns (L2TP server) specifies the local IP Address that will be assigned to the router and to the client devices.
es: Este es el archivo de configuración del servidor L2TP. Aquí se ve la dirección IP pública referenciada en el ajuste global *listen-addr*. El lns (servidor L2TP) predeterminado especifica la dirección IP local que se asignará al router y a los dispositivos cliente.

source: In this example; we have chosen to set the router's IP Address to 192.168.88.1 and we allow clients to use a range of 192.168.88.10 through 192.168.88.200. If you are accessing other internal networks; you may need to add a route to this network from other devices.
es: En este ejemplo, hemos elegido establecer la dirección IP del router en 192.168.88.1 y permitimos a los clientes utilizar un intervalo de 192.168.88.10 a 192.168.88.200. Si está accediendo a otras redes internas, es posible que tenga que añadir una ruta a esta red desde otros dispositivos.

source: One other setting of note is the *ppp debug = yes* option. This will cause verbose system logs to be generated when clients connect to the vpn service.
es: Otro ajuste a tener en cuenta es la opción *ppp debug = yes*. Esto hará que se generen registros detallados del sistema cuando los clientes se conecten al servicio vpn.

source: The final configuration file defines the users and passwords that the clients need to provide to access the VPN.
es: El archivo de configuración final define los usuarios y las contraseñas que los clientes deben proporcionar para acceder a la VPN.

source: This file is the standard chap-secrets format. Here we have two users setup; alice and bob. We see the server setting is *vnp* which is the name of the default lns set in our example xl2tpd.conf file from above. We also see the two passwords that these users have chosen. This "*" setting allows the client to get any IP address from the pool that we have defined.
es: Este archivo tiene el formato estándar de chap-secrets. Aquí tenemos dos usuarios configurados; alice y bob. Vemos que la configuración del servidor es *vnp* que es el nombre del lns predeterminado establecido en nuestro archivo xl2tpd.conf de ejemplo anteriormente. También vemos las dos contraseñas que han elegido estos usuarios. Esta configuración "*" permite al cliente obtener cualquier dirección IP del grupo que hayamos definido.

source: Firewall configuraion
es: Configuración del cortafuegos

source: By default Opuntia needs to be configured to allow incoming L2TP connections in the *wan* firewall zone. If see the firewall chapter for more general information.
es: Por defecto, Opuntia necesita ser configurado para permitir conexiones L2TP entrantes en la zona del firewall *wan*. Consulte el capítulo de cortafuegos para más información general.

source: The rule we need to add is an accept rule for the *Wan* input zone that allows TCP and UDP port 1701 traffic.
es: La regla que necesitamos añadir es una regla de aceptación para la zona de entrada *Wan* que permite el tráfico de los puertos TCP y UDP 1701.

source: Main Menu - *Network --> Firewall --> Traffic Rules*
es: Menú principal - *Red --> Firewall --> Reglas de tráfico*

source: Once that rule is installed you will see this from the firewall ruleset summary.
es: Una vez instalada esa regla, verá esto en el resumen del conjunto de reglas del cortafuegos.

source: Client Setup
es: Configuración del cliente

source: MacOS supports IPsec/L2TP clients natively. In this section we will detail the configuraion process when setting up a MacOS client to connect to our example IPsec/L2TP vpn from above.
es: MacOS soporta clientes IPsec/L2TP de forma nativa. En esta sección detallaremos el proceso de configuración de un cliente MacOS para conectarse a nuestro ejemplo anterior de vpn IPsec/L2TP.
