Repository: imagestream/opuntia-docs
Catalog: locales/*/LC_MESSAGES/Opuntia-manual.po
Languages: es

source: Table of Contents
es: Índice

source: Evpn Theory
es: Teoría de la Evpn

source: Evpn (Ethernet VPN) is a technology that connects Layer 2 network segments over a Layer 3 IP network. This allows Layer 2 networks that are seperated by Layer 3 network. This allows building
es: Una red virtual privada por ethernet , Evpn ó Ethernet VPN es una tecnología que conecta segmentos de red de capa 2 sobre una red IP de capa 3. Esto permite que las redes de capa 2 estén separadas por la red de capa 3. Lo que permite construir

source: Evpn uses VxLan tunnels and a control plane based on BGP. One of the major advantanges of Evpn is that it allows a common configuration on the remote devices.
es: Evpn utiliza túneles VxLan y un plano de control basado en BGP. Una de las principales ventajas de Evpn es que permite una configuración común en los dispositivos remotos.

source: This chapter covers the usage of the FRR (FRRouting) software that is included in Opuntia. This software provides support for the following dynamic routing protocols.
es: Este capítulo cubre el uso del software de enrutamiento de intervalo libre, FRR (FRRouting), que se incluye en Opuntia. Este software ofrece soporte para los siguientes protocolos de enrutamiento dinámico.

source: Free Range Routing
es: Enrutamiento de intervalo libre

source: Frr (FRRouting) is an OpenSource IP routing protocol suite for Linux.
es: Frr (FRRouting) es un conjunto de protocolos de enrutamiento IP de código abierto (OpenSource) para Linux.

source: IPv6 via Dynamic Routing
es: IPv6 vía enrutamiento dinámico

source: This chapter covers methods of using IPv6 networking when you are receiving IPv6 networks using dynamic routing protocols and not DHCPv6 Prefix Delegation. Since these methods require dynamic routing; the FFR chapter should be consulted if you have any questions. Please see the :ref:`FRR` chapter for more information.
es: Este capítulo cubre los métodos de uso de diseño de redes IPv6 cuando se reciben redes IPv6 usando protocolos de enrutamiento dinámicos y no Delegación de Prefijo DHCPv6. Dado que estos métodos requieren un enrutamiento dinámico, se debe consultar el capítulo sobre el FFR en caso de tener alguna duda. Para más información, consulte el capítulo :ref:`FRR`.

source: Mulitiprotocal BGP and IPv6
es: Multiprotocolo BGP e IPv6

source: Administrative Configuration
es: Configuración administrativa

source: This chapter will describe configuring Opuntia systems Administrative settings.
es: Este capítulo describirá la configuración administrativa del sistema Opuntia.

source: Changing the Password
es: Cambiar la contraseña

source: Changing the password is an instant change that does not need to be applied to take effect.
es: El cambio de la contraseña es un cambio instantáneo que no necesita aplicarse para que surta efecto.

source: **Web GUI**
es: **GUI web**

source: To change the root password, first navigate to the "Router Password" menu.
es: Para cambiar la contraseña root, primero navegue hasta el menú "Contraseña del router".

source: Main Menu - *System --> Administration*
es: Menú principal - *Sistema --> Administración*

source: Input your desired password in both boxes and click save.
es: Introduzca la contraseña deseada en ambas casillas y haga clic en guardar (save).

source: To change the root password, you use the standard Linux "passwd" utility. Below is an example.
es: Para cambiar la contraseña root, se utiliza la utilidad estándar de Linux "passwd". A continuación, un ejemplo.

source: Adding SSH Keys
es: Añadir claves SSH

source: Adding SSH authorized keys can be a convenient option when accessing an Opuntia based systems via the CLI.
es: Añadir claves autorizadas SSH puede ser una opción conveniente cuando se accede a un sistema basado en Opuntia a través de la interfaz de línea de comando (CLI).

source: To add an authorized SSH key, first navigate to the "SSH-Keys" menu.
es: Para añadir una clave SSH autorizada, primero navegue hasta el menú "SSH-Keys".

source: Main Menu - *System --> Administration* and then click the "SSH-Keys" Tab.
es: Menú principal - *Sistema --> Administración* y luego haga clic en la pestaña "SSH-Keys".

source: Adding a SSH-Key is an instant change that does not need to be applied to take effect.
es: Añadir una clave SSH es un cambio instantáneo que no necesita aplicarse para que tenga efecto.

source: Also take care when pasting the ssh key into the textbox the ssh key must be a single line of text.
es: También tenga cuidado al pegar la clave ssh en el cuadro de texto, la clave ssh debe ser una sola línea de texto.

source: Once a key is added you will see a summary of the key including the comment of the key.
es: Una vez añadida una clave, verá un resumen de la misma, incluyendo el comentario de la clave.

source: To add an authorized SSH key from the CLI you will need to edit the */etc/dropbear/authorized_keys* file.
es: Para añadir una clave SSH autorizada desde la CLI necesitará editar el archivo */etc/dropbear/authorized_keys*.

source: The authorized key file format requires each SSH key be on a single line
es: El formato de archivo de clave autorizado requiere que cada clave SSH esté en una sola línea

source: Changing the Hostname
es: Cambiar el nombre del anfitrión (Hostname)

source: To change the Hostname of the system. First navigate to the General settings page.
es: Para cambiar el Hostname del sistema. En primer lugar, vaya a la página de ajustes generales.

source: Main Menu - *System --> System*
es: Menú principal - *Sistema --> Sistema*

source: Enter your desired Hostname into the Hostname textbox. Then either click "Save" or "Save & Apply" if you want the change to happen immediately.
es: Introduzca su Hostname deseado en el cuadro de texto Hostname. A continuación, haga clic en "Guardar" o "Guardar y aplicar" si desea que el cambio se produzca inmediatamente.

source: To change the Hostname from the CLI you can edit the */etc/config/system* file. Or use the uci utility to make the needed configuration change. Examples of both methods are shown below.
es: Para cambiar el Hostname desde la CLI puede editar el archivo */etc/config/system*. O utilice la utilidad uci para realizar el cambio de configuración necesario. A continuación se muestran ejemplos de ambos métodos.

source: The "reload_config" command must be run after each of these methods to apply the changes.
es: El comando "reload_config" debe ejecutarse después de cada uno de estos métodos para aplicar los cambios.

source: Here you see the default contents of the system configuration (*/etc/config/system*). In the config system section of this file you will see the option hostname. Modify this to your desired Hostname and then save the file. After saving the file, run "reload_config" to apply the changes.
es: Aquí se ve el contenido por defecto de la configuración del sistema (*/etc/config/system*). En la sección de sistema de configuración de este archivo verá la opción hostname. Modifique esto a su Hostname deseado y luego guarde el archivo. Después de guardar el archivo, ejecute "reload_config" para aplicar los cambios.

source: And here is an example of the uci command needed to change the hostname to "Newhostname". ::
es: Y aquí hay un ejemplo del comando uci necesario para cambiar el hostname a "Newhostname" (nuevo nombre de anfitrión). ::

source: Setting Time and the Timezone
es: Ajuste de la hora y la zona horaria

source: To change the time or timezone of the system. First navigate to the General settings page.
es: Para cambiar la hora o la zona horaria del sistema. En primer lugar, vaya a la página de ajustes generales.

source: We recommend that you use the UTC timezone as it simplifies log aggreation from multiple systems.
es: Le recomendamos que utilice la zona horaria UTC, ya que simplifica la agregación de registros (log aggregation) de varios sistemas.

source: Here is the uci command to set the timezone to UTC. ::
es: Aquí está el comando uci para establecer la zona horaria a UTC. ::

source: Once you have used the uci command to change the timezone; run "reload_config" to apply the changes.
es: Una vez que haya utilizado el comando uci para cambiar la zona horaria; ejecute "reload_config" para aplicar los cambios.

source: Configuration Managment
es: Gestión de la configuración

source: This chapter will detail how to back-up, restore and reset to defaults of your system configuration.
es: Este capítulo detallará cómo hacer una copia de seguridad y restaurar y restablecer los valores predeterminados de la configuración del sistema.

source: Configuration Backup
es: Copia de seguridad de la configuración

source: The easiest wasy to get a backup of an Opuntia system is to use the Backup option on the "Flash operations" page.
es: La forma más fácil de obtener una copia de seguridad de un sistema Opuntia es utilizar la opción de Backup (copia de seguridad) en la página de "Flash operations".

source: Main Menu - *System --> Backup/Flash Firmware*
es: Menú principal - *Sistema --> Copia de seguridad/flash del firmware*

source: To get a backup; simply click the "Generate archive" button. This will cause the system to generate a backup file using the following format. "backup-<Current hostname>-<Current Date>.tar.gz". This file will be downloaded by your Web Browser.
es: Para obtener una copia de seguridad, simplemente haga clic en el botón "Generate archive". Esto hará que el sistema genere un archivo de copia de seguridad con el siguiente formato. "backup-<Hostname actual>-<Fecha actual>.tar.gz". Este archivo será descargado por su navegador web.

source: The process to backup using the CLI is more involved, you first must manually generate the backup file. And then transfer the file off of the system. ::
es: El proceso para hacer una copia de seguridad utilizando la CLI es más complicado, primero hay que generar manualmente el archivo de copia de seguridad. Y luego transferir el archivo fuera del sistema. ::

source: This will generate a backup file that matches the same format you get when using the Web GUI method. But it is possible to use whatever filename you wish.
es: Esto generará un archivo de copia de seguridad que coincide con el mismo formato que se obtiene cuando se utiliza el método de la GUI web. Sin embargo es posible utilizar cualquier nombre de archivo que desee.

source: If you do generate a backup file make sure you use the /tmp/ directory as the destination.
es: Si genera un archivo de copia de seguridad, asegúrese de utilizar el directorio /tmp/ como destino.

source: Once you have created a backup image you must transfer it off of the system. The simplest way to do this is to use the "scp" command. This allows you to transfer the image off of the system and to a remote host.
es: Una vez que haya creado una imagen de copia de seguridad, debe transferirla fuera del sistema. La forma más sencilla de hacerlo es utilizar el comando "scp". Esto le permite transferir la imagen fuera del sistema y hacia un anfitrión remoto.

source: Restoring Configurations
es: Restauración de configuraciones

source: To restore the system from a downloaded configuration file, first navigate to the "Flash operations" page.
es: Para restaurar el sistema a partir de un archivo de configuración descargado, primero navegue a la página de "Flash operations".

source: There are two options for restoring the system. You can restore from a saved backup file or you can restore the system to the default configuration. We will cover both operations in this section.
es: Hay dos opciones para restaurar el sistema. Puede restaurar desde un archivo de copia de seguridad guardado o puede restaurar el sistema a la configuración predeterminada. En esta sección cubriremos ambas operaciones.

source: To restore from a saved backup; you begin by first uploading the backup file to the Opuntia system. This is done by clicking the "Upload archive" button. This brings up a local file browser. You need to select your desired backup file. Once selected you will see the following upload summary dialog box. That will show your filename and size of the configuration file. Click upload to be the upload process.
es: Para restaurar a partir de una copia de seguridad guardada, primero hay que cargar el archivo de copia de seguridad en el sistema Opuntia. Para ello, haga clic en el botón "Upload archive". Esto hace que se muestre un explorador de archivos local. Debe seleccionar el archivo de copia de seguridad deseado. Una vez seleccionado, verá el siguiente cuadro de diálogo de resumen de carga. Eso mostrará el nombre y tamaño de su archivo de configuración. Haga clic en cargar (upload) para iniciar el proceso de carga.

source: Once the backup configuration file is uploaded, you will see a detailed list of all of the files contained in the backup configuration file. You will need to scroll to the bottom of the list to see the contine button.
es: Una vez cargado el archivo de configuración de respaldo, verá una lista detallada de todos los archivos contenidos en el archivo de configuración de respaldo. Tendrá que desplazarse hasta el final de la lista para ver el botón de continuar.

source: Once the contiue button is pressed the system will reboot. If the URL does not change, the Web GUI will reconnect after the reboot process is complete.
es: Una vez que se pulse el botón [continue] el sistema se reiniciará. Si la URL no cambia, la interfaz gráfica de usuario web volverá a conectarse una vez finalizado el proceso de reinicio.

source: The configuration can change the ip address of the system so you may have to reconnect to a different url.
es: La configuración puede cambiar la dirección ip del sistema, por lo que es posible que tenga que volver a conectarse a una url diferente.

source: This completes restoring a saved configuration file.
es: Esto completa la restauración de un archivo de configuración guardado.

source: To restore the system to a default state it is needed to click on the "Perform reset" button. And then to conferm that you want to restore to factory defaults. This then performs a system reboot.
es: Para restaurar el sistema a un estado predeterminado es necesario hacer clic en el botón "Perform reset" (Ejecutar el reinicio). Con esto se confirma que desea restaurar los valores predeterminados de fábrica. Esto hace que se reinicie el sistema.

source: To restore a saved backup configuration file using the command line interface you must first upload the file to the system. The recommended method is to use "scp" to upload the file.
es: Para restaurar un archivo de configuración de copia de seguridad guardado utilizando la interfaz de línea de comandos (CLI), primero debe cargar el archivo en el sistema. El método recomendado es utilizar "scp" para cargar el archivo.

source: If you are manual uploading configuration files to a system you must use the /tmp directory as the destination for the file.
es: Si está cargando manualmente archivos de configuración a un sistema, debe utilizar el directorio /tmp como destino del archivo.

source: Covering all the options of the scp command is beyond the scope of this manual. But this command line and example will work for most situations. This example assumes that the filename of the backup file is "backup-Opuntia-2020-04-09.tar.gz" and the Opuntia system has an ip address of 192.168.79.14 ::
es: Cubrir todas las opciones del comando scp está más allá del alcance de este manual. Pero esta línea de comando y el ejemplo funcionarán para la mayoría de las situaciones. Este ejemplo supone que el nombre del archivo de la copia de seguridad es "backup-Opuntia-2020-04-09.tar.gz" y que el sistema Opuntia tiene una dirección ip de 192.168.79.14 ::

source: To restore from the uploaded use the following command. If you do not wish to reboot immediately remove the "reboot" from the end of this example. ::
es: Para restaurar desde la carga utilice el siguiente comando. Si no desea reiniciar inmediatamente, elimine "reboot" del final de este ejemplo. ::

source: DHCP Server
es: Servidor DHCP

source: General Settings
es: Configuración general

source: IPv4 Settings
es: Configuración de IPv4

source: IPv6 Settings
es: Configuración de IPv6

source: Firewall configuration
es: Configuración del cortafuegos

source: This chapter covers Firewall configuration and theory for Opuntia systems. Opuntia is a Linux based operating system. The firewall subsystem uses the standard Linux Netfilter project tools and methods to provide IPv4 and IPv6 packet filtering.
es: Este capítulo cubre la configuración y teoría del cortafuegos (firewall) para el sistema Opuntia. Opuntia es un sistema operativo basado en Linux. El subsistema de cortafuegos utiliza las herramientas y métodos estándar del proyecto Netfilter de Linux para proporcionar el filtrado de paquetes de IPv4 e IPv6.

source: Major features of Netfilter
es: Principales características de Netfilter

source: Stateless Packet Filtering
es: Filtrado de paquetes sin estado

source: Statefull Packet Filtering
es: Filtrado de paquetes con estado

source: Network Address Translation
es: Traducción de direcciones de red

source: Port Address Translation
es: Traducción de direcciones de puerto

source: In this section of the Opuntia manual we will provide examples of using these features. As a reveiw here is general packet flow[1] through the Linux Netfilter chains and tables.
es: En esta sección del manual de Opuntia proporcionaremos ejemplos de uso de estas características. A modo de revisión, aquí se presenta el flujo general de paquetes[1] a través de las cadenas y tablas de Netfilter de Linux.

source: Zone based Firewall Theory
es: Teoría del cortafuegos basado en zonas

source: The standard Linux firewalling features can result in long and repetitive configuraions if you want a rule to apply to multiple interfaces. To help overcome these issues, Opuntia implments Zone based firewalling. Zones allow you to group multiple interfaces into a Zone and then apply a single firewall rule to the Zone. This simplifies the configuraion of the firewall ruleset by reducing the total number of rules.
es: Las funciones estándar de cortafuegos de Linux pueden dar lugar a configuraciones largas y repetitivas si se desea que una regla se aplique a varias interfaces. Para ayudar a superar estos problemas, Opuntia implanta el sistema de cortafuegos (firewalling) basado en zonas. Las zonas le permiten agrupar varias interfaces en una Zona y luego aplicar una única regla de cortafuegos a la Zona. Esto simplifica la configuración del conjunto de reglas del cortafuegos al reducir el número total de reglas.

source: Opuntia implments two Zones by default *Management* and *Wan*.
es: Opuntia implanta dos Zonas predeterminadas *Gestión* y *Wan*.

source: Depending on your hardware platform; interfaces may be included in the *Wan* or *Management* zones by default. See your QuickStart Guide for more information.
es: Dependiendo de su plataforma de hardware; las interfaces pueden estar incluidas en las zonas predeterminadas *Wan* o *Gestión*. Consulte su Guía de inicio rápido para obtener más información.

source: By default Opuntia allows access to the Web GUI on ANY IPv4/IPv6 interface address. The
es: Por defecto, Opuntia permite el acceso a la GUI Web en CUALQUIER dirección de interfaz IPv4/IPv6. El

source: Firewall
es: Cortafuegos (firewall)

source: To navigate to the Firewall configuraion page.
es: Navegar a la página de configuración del cortafuegos (firewall).

source: Main Menu - *Network --> Firewall*
es: Menú principal - *Red --> Firewall*

source: General Settings Tab
es: Pestaña de configuración general

source: The Firewall *General Settings* tab has three main sections.
es: La pestaña *Configuración general* del cortafuegos (Firewall) tiene tres secciones principales.

source: Routing/Nat Offloading
es: Enrutamiento/descarga NAT

source: Zones
es: Zonas

source: I know it's odd that the GUI tab is "General Settings" and there is a subsection that is also named "General Settings" but this is how the GUI organizes these settings. There are two settings in this section. *Enable Syn-Flood Protection* and *Drop Invalid Packets*. Syn-Flood Protection is enabled by default on all Opuntia platforms. This option is unlikely to cause any issues.
es: Sé que es extraño que la pestaña de la GUI sea "Configuración general" y que exista una subsección que también se llame "Configuración general", pero así es como la GUI organiza estos ajustes. Hay dos ajustes en esta sección. *Habilitar la protección Inundación-Syn* y *Rechazar paquetes no válidos*. La protección Inundación-Syn está activada por defecto en todas las plataformas Opuntia. Es poco probable que esta opción cause problemas.

source: The *Drop Invalid Packets* option is not enabled by default on any Opuntia platform. This option creates a series of firewall rules that aim to drop invalid packets flowing through the system. This is often a safe option to enable. The most impactful rule that this option creates is a rule to drop packets that are not known in the Netfilter conntrack table.
es: La opción *Drop Invalid Packets* (Rechazar paquetes no válidos) no está habilitada por defecto en ninguna plataforma de Opuntia. Esta opción crea una serie de reglas de cortafuegos cuyo objetivo es descartar los paquetes no válidos que circulan por el sistema. Esta suele ser una opción segura para activar. La regla más impactante que crea esta opción es una regla para descartar los paquetes que no se conocen en la tabla de seguimiento de conexiones (conntrack) de Netfilter.

source: In most cases where there is a only a single Internet gateway this configuraion is acceptable. But if any Multi-Path Routing is being used; this option will cause packet loss and interrupted connections. So take care if you decide to enable this configuraion and you have Multi-Path Routing.
es: En la mayoría de los casos en los que hay una sola puerta de acceso a Internet, esta configuración es aceptable. Pero si se utiliza algún tipo de enrutamiento multitrayectoria Multi-Path Routing), esta opción provocará la pérdida de paquetes y la interrupción de las conexiones. Así que tenga cuidado si decide habilitar esta configuración y tiene enrutamiento multitrayectoria.

source: Additionally there are the three default policy selections in this section. The by default Opuntia has these all set to accept. It's possible to change these options but it should be done with care if you modify the INPUT or FORWARD chain.
es: Además, en esta sección están las tres selecciones de políticas predeterminadas. El valor predeterminado de Opuntia tiene todas las anteriores configuradas para aceptar. Es posible cambiar estas opciones pero debe hacerse con cuidado si se modifica la cadena INPUT o FORWARD.

source: This section has two options. *Software flow Offloading* and if you enable that option you will also see the *Hardware flow Offloading* option. These options can allow you to lower cpu usage by bypassing some of the default Netfilter packet processing for known packet flows. This can sometimes cause issues with applications. So these are not enabled by default.
es: Esta sección tiene dos opciones. *Software flow Offloading* (descarga de flujo por software) y si activa esa opción también verá la opción *Hardware flow Offloading* (descarga de flujo por hardware). Estas opciones pueden permitirle reducir el uso de la cpu omitiendo parte del procesamiento de paquetes predeterminados de Netfilter para los flujos de paquetes conocidos. Esto a veces puede causar problemas con las aplicaciones. Por lo tanto, no están activados por defecto.
