Repository: imagestream/opuntia-docs
Catalog: locales/*/LC_MESSAGES/Opuntia-manual.po
Languages: es

source: This provides a robust platform for many modern IT applications.
es: Esto proporciona una plataforma sólida para muchas aplicaciones informáticas modernas.

source: Overview
es: Resumen

source: This documentation is generic to all Opuntia hardware platforms. For specific information on an Imagestream router please look the the correct quickstart guide.
es: Esta documentación es genérica para todas las plataformas de hardware de Opuntia. Para obtener información específica sobre un router Imagestream, consulte la guía de inicio rápido correspondiente.

source: Since this is generic documentation that describes all Opuntia based systems, you may find differences in Interface names, default configurations or other hardware/configuration changes depending on your hardware platform. All platforms share the list of software features but they may lack the hardware requirements to run all configurations or services.
es: Dado que esta es una documentación genérica que describe todos los sistemas basados en Opuntia, puede encontrar diferencias en los nombres de las interfaces, las configuraciones predeterminadas u otros cambios de hardware/configuración dependiendo de su plataforma de hardware. Todas las plataformas comparten la lista de características de software, pero pueden carecer de los requisitos de hardware para ejecutar todas las configuraciones o servicios.

source: Using this documentation
es: Uso de esta documentación

source: Many of the tasks described in this documentation require navigating through the web GUI menu system. In this document, we will use the following syntax to describe navigating through the GUI menu.
es: Muchas de las tareas descritas en esta documentación requieren navegar por el sistema de menús de la interfaz gráfica de usuario de la web. En este documento, utilizaremos la siguiente sintaxis para describir la navegación a través del menú de la GUI.

source: This would describe clicking on the "System" button on the top GUI menu and selecting the Administration link from the drop-down menu.
es: Esto describirá que se debe hacer clic en el botón "Sistema" del menú superior de la interfaz gráfica de usuario (GUI) y seleccionar el enlace Administración en el menú desplegable.

source: When using the CLI there are often two methods to change configuration settings. The first method is to use the "uci" command to set configuration parameters. This tool is good for automation and scripting usage. The second method is to edit the correct configuration file located in the "/etc/config/" directory. This is often the most convenient method make configuration changes. But it's possible to input invalid configurations when directly editing the settings. We will provide examples of each method when relevant.
es: Cuando se utiliza la CLI suele haber dos métodos para cambiar los ajustes de configuración. El primer método es utilizar el comando "uci" para establecer los parámetros de configuración. Esta herramienta es adecuada para la automatización y el uso de scripts. El segundo método consiste en editar el archivo de configuración correcto situado en el directorio "/etc/config/". Este suele ser el método más conveniente para realizar cambios de configuración. Sin embargo, es posible introducir configuraciones no válidas al editar directamente los ajustes. Cuando sea pertinente, daremos ejemplos de cada método.

source: Some configuration options from the command line and the Web GUI apply instantly when the configuration is saved. An example of this is the root password. Once input in the CLI or the web GUI the password is changed and no further saving needs to be done. This is in contrast to most configuration settings must be "applied" before they take place. Where possible this will be noted.
es: Algunas opciones de configuración de la línea de comandos y de la GUI web se aplican instantáneamente cuando se guarda la configuración. Un ejemplo de ello es la contraseña de root. Una vez introducida en la CLI o en la GUI web, la contraseña se cambia y no es necesario guardar nada más. Esto contrasta con la mayoría de los ajustes de configuración que deben ser "aplicados" antes de que tengan lugar. Siempre que sea posible, se tomará nota de ello.

source: When making changes from the CLI if the change is not instantly applied; it will be required to run the "reload_config" command. This is equivlent to clicking the "Save & Apply" in the Web GUI. Until this is done, these configue changes are not applied to the system.
es: Cuando se hacen cambios desde la CLI, si el cambio no se aplica instantáneamente; será necesario ejecutar el comando "reload_config". Esto equivale a hacer clic en el botón "Guardar y Aplicar" en la GUI web. Hasta que no se haga esto, estos cambios de configuración no se aplican al sistema.

source: When using the Web GUI it's possible to "Save & Apply" the configuration while by-passing normal configuration checks. This can be usful in some situations. To do this, click the small downwards facing triangle on the "Save & Apply" button and select the option.
es: Cuando se utiliza la GUI Web es posible "Guardar y Aplicar" la configuración mientras se omiten las comprobaciones de configuración normales. Esto puede ser útil en algunas situaciones. Para ello, haga clic en el pequeño triángulo orientado hacia abajo en el botón "Guardar y aplicar" y seleccione la opción.

source: Accessing Opuntia
es: Acceso a Opuntia

source: Connectivity
es: Conectividad

source: Opuntia can run on a wide varity of systems from wireless AP's, small routers, large systems and virtual machines. This wide varity of equipment requires that specific access methods are going to depend on the platform that your Opuntia system is currently using. Please reference the Quickstart guide for your specific device information.
es: Opuntia puede funcionar en una amplia variedad de sistemas, desde AP inalámbricos, enrutadores (router) pequeños, grandes sistemas y máquinas virtuales. Esta amplia variedad de equipos requiere que los métodos de acceso específicos van a depender de la plataforma que su sistema Opuntia está utilizando actualmente. Consulte la guía de inicio rápido para obtener información específica sobre su dispositivo.

source: Access via Web GUI
es: Acceso vía GUI web

source: The easiest way to access Opuntia is via the Web GUI. You can access the Web GUI using any IPv4 or IPv6 ip addess that is assigned to the Opuntia system. The *Wan* and any *Lan* interface will allow access to the Web GUI. This might be more a permisive access than some administrators perfer. Please see the following section for restricting access to the :ref:`Hardening-Web-GUI`.
es: La forma más fácil de acceder a Opuntia es a través de la interfaz gráfica de usuario de la web (GUI Web). Puede acceder a la GUI Web utilizando cualquier dirección IPv4 o IPv6 asignada al sistema Opuntia. La interfaz *Wan* y cualquiera *Lan* permitirán el acceso a la GUI Web. Esto podría ser un acceso más permisivo de lo que algunos administradores prefieren. Consulte la siguiente sección para restringir el acceso a la :ref:`Refuerzo-GUI Web`.

source: To access the Web GUI via IPv6 you need to use the syntax "https://[IPv6 addess]/". For example if you if your IPv6 management IP address was 2605:6:62:ba40::1 then you would use this url "https://[2605:6:62:ba40::1]/".
es: Para acceder a la GUI Web a través de IPv6 es necesario utilizar la sintaxis "https://[dirección IPv6]/". Por ejemplo, si su dirección IP de gestión IPv6 fuera 2605:6:62:ba40::1, utilizaría esta url "https://[2605:6:62:ba40::1]/".

source: Opuntia by default ships with a Self Signed SSL certificate. This will likely cause a security error when accessing the Web GUI. Given that Opuntia devices can not be assumeed to always have Internet access we are currently unable to include a updated valid certificate for every device. ImageStream is currently working to resolve this issue.
es: Opuntia se entrega por defecto con un certificado SSL auto-firmado. Esto probablemente causará un error de seguridad al acceder a la GUI web. Debido a que no se puede asumir que los dispositivos de Opuntia tengan siempre acceso a Internet, por el momento no podemos incluir un certificado válido actualizado para cada dispositivo. ImageStream está trabajando actualmente para resolver este problema.

source: Access via SSH
es: Acceso vía SSH

source: Opuntia supports ssh access to the Linux command line ( ash shell ). Opuntia by default allows SSH access on all localy configured IPv4/IPv6 addresses. This allows easy access for system administrators but my not be the perfered configuration from a security standpoint. Please see the :ref:`Hardening-SSH-Access` chapter if this default is not acceptable.
es: Opuntia es compatible con el acceso ssh a la línea de comandos de Linux ( ash shell ). Opuntia, por defecto, permite el acceso SSH en todas las direcciones IPv4/IPv6 configuradas de manera local. Esto permite un fácil acceso a los administradores del sistema, pero puede no ser la configuración más adecuada desde el punto de vista de la seguridad. Le sugerimos que consulte el capítulo :ref:`Refuerzo Acceso SSH` si este valor por defecto no es aceptable.

source: In all cases recommend adding ssh keys for normal operation. See this chapter for more details :ref:`Adding-SSH-Keys`.
es: En todos los casos se recomienda añadir claves ssh para un funcionamiento normal. Consulte este capítulo para más detalles :ref:`Añadiendo claves SSH`.

source: Access via Serial Console
es: Acceso vía consola serie

source: For hardware platforms that include a Serial Console; you can connect to the Local Console using the Serial connection. This is typically running at a speed of 115.2kbps with 8n1. Depending on the hardware platform you may need a null Serial connection. Please check with your Quickstart guide to see if this is the case.
es: Para las plataformas de hardware que incluyen una consola serie; puede conectarse a la consola Local utilizando la conexión serie. Suele funcionar a una velocidad de 115,2kbps con 8n1. Dependiendo de la plataforma de hardware, es posible que necesite una conexión serie nula. Consulte su guía de inicio rápido para ver si este es el caso.

source: A common issue with Serial connections is cables the lack connected pins this can cause the connection to fail in unexpected ways (for example seeing output but not being able to send keystrokes). Take care you a using the correct cable for your hardware platform.
es: Un problema común con las conexiones serie son los cables y la falta de terminales conectados; esto puede causar que la conexión falle de manera inesperada (por ejemplo ver la salida pero no poder enviar pulsaciones). Tenga cuidado de utilizar el cable correcto para su plataforma de hardware.

source: The specific connector and cable combination will depend on the hardware platform. If your hardware platform supports an RJ-45 Serial connection, the pin-out will be as follows.
es: La combinación específica de conector y cable dependerá de la plataforma de hardware. Si su plataforma de hardware admite una conexión serie RJ-45, la distribución de terminales será la siguiente.

source: RJ-45 to DE-9 Pinout Table
es: Tabla de terminales RJ-45 a DE-9

source: RJ-45 Cable Pin
es: Terminal del Cable RJ-45

source: RJ-45 Definition
es: Definición de RJ-45

source: DE-9 Pin
es: Terminal DE-9

source: DE-9 Definition
es: Definición de DE-9

source: Brown
es: Marrón

source: Purple
es: Púrpura

source: Yellow
es: Amarillo

source: Red
es: Rojo

source: Black
es: Negro

source: Orange
es: Naranja

source: Blue
es: Azul

source: Green
es: Verde

source: No Connect
es: Sin conexión

source: Once you have a Serial connection established, you can press any key to activate the Serial console.
es: Una vez establecida la conexión serie, puede pulsar cualquier tecla para activar la consola serie.

source: By default the Serial console has no security. Security is provided by the requirement that accessing the Serial console requires phyical localiticy to the Opuntia system. This my not always be true; for example if you are access the Serial console using a remote system. In this case it is highly recommend that you require password login on the Serial console please see the :ref:`Hardening-Local-Console` chapter for more information.
es: Por defecto la consola Serial no tiene seguridad. La seguridad es proporcionada por el requisito de que el acceso a la consola Serie requiere la localización física del sistema Opuntia. Esto no siempre puede ser cierto; por ejemplo, si usted está accediendo a la consola serie usando un sistema remoto. En este caso es altamente recomendable que requiera el ingreso de una contraseña en la consola serie; consulte el capítulo :ref:`Refuerzo consola local` para más información.

source: Access via Local Console
es: Acceso vía consola local

source: On hardware platforms that support USB and Video connections. Accessing the CLI is very simple. Just connect a keyboard and monitor to the system and then press any key on the keyboard. This will spawn a new ash CLI shell.
es: Para las plataformas de hardware que admiten conexiones USB y de vídeo. El acceso a la CLI es muy sencillo. Basta con conectar un teclado y un monitor al sistema y pulsar cualquier tecla del teclado. Esto generará una consola ash CLI nueva.

source: By default the Local console has no security. Security is provided by the requirement that accessing the Local console requires phyical localiticy to the Opuntia system. This my not always be true; for example if you are access the Local console using a remote system. In this case it is highly recommend that you require password login on the Local console please see the :ref:`Hardening-Local-Console` chapter for more information.
es: Por defecto, la consola local no tiene seguridad. La seguridad es proporcionada por el requisito de que el acceso a la consola local requiere la localización física del sistema Opuntia. Esto no siempre puede ser cierto; por ejemplo, si usted está accediendo a la consola local usando un sistema remoto. En este caso es altamente recomendable que requiera el ingreso de una contraseña en la consola local; consulte el capítulo :ref:`Refuerzo consola local` para más información.

source: Security Hardening
es: Refuerzo de la seguridad

source: This chapter covers Security Hardening prodcures for Opuntia systems. By default Opuntia is configured to allow easy access to the system for administration. But these settings were chosen to favor access over security concerns. Opuntia does not come with an insecure configuration; but it allows access to login prompts in several situations that administrators should consider limiting access in higher security configurations.
es: Este capítulo cubre los procedimientos para refuerzo de la seguridad de los sistemas Opuntia. Por defecto, Opuntia está configurado para permitir un fácil acceso al sistema para su administración. Pero estos ajustes se eligieron para favorecer el acceso por encima de las preocupaciones de seguridad. Opuntia no tiene una configuración insegura; no obstante despliega avisos de inicio de sesión en varias situaciones en las que los administradores deberían considerar limitar el acceso a configuraciones de mayor seguridad.

source: When possible, administrators should consider sperating the control plane of your network from the data plane.
es: Cuando sea posible, los administradores deben considerar la posibilidad de separar el plano de control de su red del plano de datos.

source: Hardening Web GUI
es: Refuerzo de la GUI de la web

source: By default Opuntia allows access to the Web GUI on ANY IPv4/IPv6 interface address. We recommend excluding access to the Web GUI to the default *Wan* Firewall zone. Please see the :ref:`Firewall-Limiting-External-access` chapter for more information.
es: Por defecto, Opuntia permite el acceso a la GUI Web en CUALQUIER dirección de interfaz IPv4/IPv6. Recomendamos excluir el acceso a la GUI Web a la zona del cortafuegos *Wan* predeterminada. Consulte el capítulo :ref:`Cortafuegos-Limitación de acceso externo` para obtener más información.

source: Hardening SSH Access
es: Refuerzo del acceso SSH

source: By default Opuntia will respond to Ssh connection atempts to any bound IPv4/IPv6 address. We recommend excluding access to Ssh from the default *Wan* Firewall zone. Please see the :ref:`Firewall-Limiting-External-access` chapter for more information.
es: Por defecto, Opuntia responderá a los intentos de conexión Ssh a cualquier dirección IPv4/IPv6 vinculada. Recomendamos excluir el acceso a Ssh de la zona del cortafuegos *Wan* predeterminada. Consulte el capítulo :ref:`Cortafuegos-Limitación de acceso externo` para obtener más información.

source: Hardening Serial / Local Console
es: Refuerzo de la Consola Serie / Local

source: This requires Opuntia version 4.8.16 r49304 or newer.
es: Esto requiere la versión 4.8.16 r49304 o más reciente de Opuntia.

source: By default Opuntia does not require a password when accessing system from a Serial or Local console. Since this requires physical access to hardware platforms this is generally considered safe. But Virtual Machines running Opuntia often do have remote methods to access the Local console. So this is an important security concern.
es: Por defecto, Opuntia no requiere una contraseña cuando se accede al sistema desde una consola Serie o Local. Dado que esto requiere el acceso físico a las plataformas de hardware, generalmente se considera seguro. Sin embargo, las máquinas virtuales que ejecutan Opuntia suelen tener métodos remotos para acceder a la consola local. Por lo que esto resulta en una importante preocupación de seguridad.

source: To require a password for Serial / Local Console logins use the following prodcure.
es: Para solicitar una contraseña para los inicios de sesión de la Consola Serial / Local utilice el siguiente procedimiento.

source: To make these adjustments use the following commands from the CLI ::
es: Para realizar estos ajustes utilice los siguientes comandos de la CLI ::
