Repository: imagestream/opuntia-docs
Catalog: locales/*/LC_MESSAGES/Opuntia-manual.po
Languages: es

source: To ensure that you are using CIDR List notation. Click the small check box at the end of the IPv4 address box.
es: Para asegurarse de que está utilizando la notación de la lista CIDR. Haga clic en la pequeña casilla de verificación situada al final del cuadro de direcciones IPv4.

source: When operting is CIDR notation it's import to make sure that you click the "+" button after typing in the address or it will not be saved.
es: Cuando se opera en notación CIDR es importante asegurarse de que se hace clic en el botón "+" después de escribir la dirección o no se guardará.

source: This example shows an address that has **NOT** been saved correctly.
es: Este ejemplo muestra una dirección que **NO** ha sido guardada correctamente.

source: And this example shows the address is correctly saved. You will see a new text box below all saved addresses.
es: Y este ejemplo muestra que la dirección se guarda correctamente. Verá un cuadro de texto nuevo debajo de todas las direcciones guardadas.

source: Other important IPv4 settings include "IPv4 gateway". It's important to note that this should only be set on a single interface since this will set the global default IPv4 route for the system.
es: Otras configuraciones importantes de IPv4 incluyen "Puerta de enlace IPv4". Es importante tener en cuenta que esto debe establecerse únicamente en una sola interfaz, ya que esto fijará la ruta global IPv4 predeterminada para el sistema.

source: **IPv6 with Prefix Delegation**
es: **IPv6 con delegación de prefijo**

source: With IPv6 deployments the majority of configurations will be using ISP provided network space. If your deployment uses provider delegated network Prefixes you **MUST** use the built IPv6 management options described below and DHCP server **MUST** be enabled on this interface.
es: Con las implementaciones IPv6, la mayoría de las configuraciones utilizarán el espacio de red proporcionado por el ISP. Si su implementación utiliza prefijos de red delegados por el proveedor, **DEBE** utilizar las opciones de gestión de IPv6 incorporadas que se describen a continuación y el servidor DHCP **DEBE** estar habilitado en esta interfaz.

source: The Opuntia operating system includes an automatic system to manage IPv6 when you recieve a IPv6 Prefix delegation from an upstream provider. This automatic system will ensure that the system is providing downstream clients with the correct IPv6 addresses and manages any changes in routing that may be required. IPv6 Prefix delegation is by far the most common configuration scenario if you are connecting to the IPv6 Internet. This is fundementatly a dynamic proccess that makes it impossible to set a static IPv6 address.
es: El sistema operativo Opuntia incluye un sistema automático de gestión de IPv6 cuando recibe una delegación de prefijo IPv6 de un proveedor ascendente. Este sistema automático se asegurará de que el sistema está proporcionando a los clientes descendentes las direcciones IPv6 correctas y gestiona cualquier cambio en el enrutamiento que pueda ser necesario. La delegación de prefijos IPv6 es, con mucho, el escenario de configuración más común si se conecta a Internet IPv6. Se trata de un proceso fundamentalmente dinámico que hace imposible establecer una dirección IPv6 estática.

source: But the built-in IPv6 management system does allow for several tunable values that allows the system administrator to control the deployment of IPv6 networks and addresses. In order of importance these options are; IPv6 assignment length, IPv6 suffix and IPv6 assignment hint. Each of these options will be discussed in detail in this section. It is important understand that in most common configurations the only settting that you are likely to configure is IPv6 assignment length. The other two values are likely to remain unconfigured or in the default state.
es: Pero el sistema de gestión IPv6 incorporado permite varios valores ajustables que permiten al administrador del sistema controlar la implementación de redes y direcciones IPv6. Por orden de importancia, estas opciones son: longitud de la asignación IPv6, sufijo IPv6 e indicación de asignación IPv6. Cada una de estas opciones se analizará en detalle en esta sección. Es importante entender que en la mayoría de las configuraciones comunes el único ajuste que es probable que usted configure es la longitud de asignación IPv6. Los otros dos valores probablemente permanecerán sin configurar o en el estado predeterminado.

source: The "IPv6 assignment length" allows the administrator to chose the desired IPv4 prefix length for the interface. This setting is also used to signal to the Opuntia operating system to enable to built-in IPv6 management on this interface. Selecting any value will disable the normal static IPv6 configuration options for setting a static IPv6 address, IPv6 gateway and IPv6 routed prefix.
es: La opción "Longitud de la asignación IPv6" permite al administrador elegir la longitud del prefijo IPv4 deseado para la interfaz. Esta configuración también se utiliza para indicar al sistema operativo Opuntia que habilite la gestión IPv6 incorporada en esta interfaz. Al seleccionar cualquier valor se desactivarán las opciones normales de configuración estática de IPv6 para establecer una dirección IPv6 estática, una puerta de enlace IPv6 y un prefijo enrutado IPv6.

source: IPv6 assignment length is typically set to 64 bits. A IPv6 Prefix length of 64 bits allows for the standard IPv6 address auto-configuration for most client devices (SLAAC and DHCPv6). To function correctly you must recieve a IPv6 Prefix delegation from an upstream provider.
es: La longitud de la asignación IPv6 suele ser de 64 bits. Una longitud de prefijo IPv6 de 64 bits permite la autoconfiguración de direcciones IPv6 estándar para la mayoría de los dispositivos cliente (SLAAC y DHCPv6). Para que funcione correctamente debe recibir una delegación de prefijo IPv6 de un proveedor ascendente.

source: For example if the Opuntia system recieved a IPv6 prefix delegation of 2605:540:1::/60 and we set the "IPv6 assignment length" to 64 bits; Opuntia will configure one of the 16 /64 network ranges in the 2605:540:1::/60 delegation on this interface. If the upstream provider changes the IPv6 prefix delegation those changes will be automatically applied to all downstream devices.
es: Por ejemplo, si el sistema Opuntia recibió una delegación de prefijo IPv6 de 2605:540:1::/60 y establecemos la "longitud de asignación IPv6" a 64 bits, Opuntia configurará uno de los 16 intervalos de red /64 en la delegación 2605:540:1::/60 en esta interfaz. Si el proveedor ascendente cambia la delegación del prefijo IPv6, esos cambios se aplicarán automáticamente a todos los dispositivos descendentes.

source: Most client operating sytems install IPv6 routes using the link local address of the router. So a human readable address on a interface is purely a management feature.
es: La mayoría de los sistemas operativos cliente instalan rutas IPv6 utilizando la dirección de enlace local del router. De esta manera una dirección legible para el ser humano en una interfaz es puramente una característica de gestión.

source: The "IPv6 suffix" sets the IPv6 Interface ID. This is the last 64bits of a IPv6 address. This allows the administrator to control the last part of an IPv6 address that is assigned. Given our example of receiving a IPv6 prefix of 2605:540:1::/64 if we were set the the "IPv6 suffix" to "::100:1"; the expected IPv6 address assigned to the interface would be 2605:540:1::100:1/64. This setting does have a default value of "::1" so in many cases you will not need to make adjustments to this setting if you want your routers IPv6 to in ::1.
es: El "sufijo IPv6" establece la ID de la interfaz IPv6. Son los últimos 64 bits de una dirección IPv6. Esto permite al administrador controlar la última parte de una dirección IPv6 que se asigna. Teniendo en cuenta nuestro ejemplo de recibir un prefijo IPv6 de 2605:540:1::/64, si estableciéramos el "sufijo IPv6" como "::100:1", la dirección IPv6 prevista asignada a la interfaz sería 2605:540:1::100:1/64. Esta configuración tiene un valor por defecto de "::1" por lo que en muchos casos no tendrá que hacer ajustes a esta configuración si desea sus router IPv6 en ::1.

source: Setting the IPv6 suffix setting is useful for network troubleshooting. It allows you to set the human readable IPv6 address that the router will use when being probed with standard troubleshooting tools like traceroute and ping.
es: La configuración del sufijo IPv6 es útil para la resolución de problemas de la red. Permite establecer la dirección IPv6 legible para el ser humano que el router utilizará cuando sea sondeado con herramientas estándar de resolución de problemas como traceroute y ping.

source: If a "IPv6 assignment hint" is outside of the IPv6 prefix ranges that are available this setting will have no effect.
es: Si una "indicación de asignación de IPv6" está fuera de los intervalos de prefijos IPv6 disponibles, esta configuración no tendrá efecto.

source: If we wanted to control which /64 IPv6 prefix will be selected we can use the second setting "IPv6 assignment hint". This is an optional value, the default is not set. If this option is in the default state, the system will try to effecently allocate IPv6 networks. If control of the assigned network is required; the value is a hex number that matches sub-Prefix ID. So in this example if we want to assign 2605:540:1:2::/64 we could set the hint value to "2". Or if it was required to assign 2605:540:1:f::/64 we would set the value to "f".
es: Si quisiéramos controlar qué prefijo /64 IPv6 se seleccionará podemos utilizar el segundo ajuste "IPv6 indicación de asignación" (assignment hint). Este es un valor opcional, no se establece de manera predeterminada. Si esta opción está en el estado por defecto, el sistema intentará asignar eficazmente las redes IPv6. Si se requiere el control de la red asignada; el valor es un número hexadecimal que coincide con la ID del sub-Prefijo. Así, en este ejemplo, si queremos asignar 2605:540:1:2::/64 podríamos establecer el valor de la indicación como "2". O si se requiriera asignar 2605:540:1:f::/64 fijaríamos el valor a "f".

source: Given the dynamic nature of IPv6 prefix delegation it is often not required to control the specific network. Also it's important to remember that this is a "hint" that requires the expected network address to be included in your IPv6 prefix delegation. If your provider adjustes the assigned prefix delegation it is quite possible that your "hint" will no longer be able to map to a valid network range. That would result this setting having no effect. For this reason we suggest not using this feature if you are receiving a Prefix Delegation. But it is useful in a few deployment scenarios so it's usage is detailed here.
es: Dada la naturaleza dinámica de la delegación de prefijos IPv6, a menudo no es necesario controlar la red específica. También es importante recordar que esto es una "indicación" que requiere que la dirección de red prevista sea incluida en su delegación de prefijo IPv6. Si su proveedor ajusta la delegación de prefijos asignada es muy posible que su "indicación" ya no pueda asignarse a un intervalo de red válido. Eso haría que este ajuste no tuviera ningún efecto. Por este motivo, le sugerimos que no utilice esta función si está recibiendo una delegación de prefijo. Sin embargo, es útil en algunos escenarios de implementación, por lo que su uso se detalla aquí.

source: **DHCP/DHCPv6 settings - Static protocol**
es: **Configuración de DHCP/DHCPv6 - Protocolo estático**

source: It is a required that you use DHCP server settings on the interface for downstream devices to recieve IPv6 prefix delegation.
es: Es necesario utilizar la configuración del servidor DHCP en la interfaz para que los dispositivos descendentes reciban la delegación de prefijo IPv6.

source: Client devices normally are not statically assigned IPv6 addresses. If you are using the recommended Opuntia built-in IPv6 management to delegate IPv6 Prefixes you must configure DHCP/DHCPv6 server on this interface. This section will contain only a brief list of commands and settings needed to ensure that client devices will function. For a full description of the DHCP / DHCPv6 server Interface settings and Global DHCP settings please look at the DHCP Server chapter linked below.
es: Los dispositivos cliente normalmente no tienen asignadas direcciones IPv6 de forma estática. Si está utilizando la gestión de IPv6 incorporada en Opuntia recomendada para delegar prefijos IPv6, debe configurar el servidor DHCP/DHCPv6 en esta interfaz. Esta sección sólo contendrá una breve lista de comandos y ajustes necesarios para garantizar el funcionamiento de los dispositivos cliente. Para una descripción completa de la configuración de la interfaz del servidor DHCP / DHCPv6 y de la configuración global de DHCP, consulte el capítulo sobre el servidor DHCP que aparece a continuación.

source: :doc:`dhcp-server`
es: :doc:`servidor-dhcp`

source: To begin, Edit the interface and click to the "DHCP Server" tab. You will see a large button labled "Setup DHCP Server".
es: Para comenzar, edite la interfaz y haga clic en la pestaña "Servidor DHCP". Verá un botón grande denominado "Configurar servidor DHCP".

source: This tab shows the basic DHCP server settings for the interface.
es: Esta pestaña muestra la configuración básica del servidor DHCP para la interfaz.

source: Ignore interface
es: Ignorar la interfaz

source: Start
es: Inicio

source: Limit
es: Límite

source: Lease time
es: Tiempo de concesión

source: The "Ignore interface" checkbox will disable the IPv4 DHCP server on this interface. If selected this will automatically hide the "advanced settings" tab. This can be a useful configuration option if you are manually assiging IPv4 addresses but you want to use the built-in IPv6 subsystem.
es: La casilla "Ignorar la interfaz" desactivará el servidor DHCP IPv4 en esta interfaz. Si se selecciona, ocultará automáticamente la pestaña de "ajustes avanzados". Esta puede ser una opción de configuración útil si está asignando de manera manual direcciones IPv4 pero quiere usar el subsistema IPv6 incorporado.

source: The "Start" configuration setting specifies where in the IPv4 network range to begin allocating DHCP client ip addresses. For example if you have a static network of 192.168.85.0/24 allocated to the interface and you have the "Start" setting set to 100; the lowest ip address that can be allocated is 192.168.85.100. This is a required setting if DHCP server is enabled.
es: El ajuste de configuración "Inicio" especifica en qué lugar del intervalo de la red IPv4 se comienza a asignar las direcciones ip de los clientes DHCP. Por ejemplo, si tiene una red estática de 192.168.85.0/24 asignada a la interfaz y tiene la configuración Inicio" establecida en 100; la dirección ip más baja que se puede asignar es 192.168.85.100. Esta es una configuración necesaria si el servidor DHCP está activado.

source: The "Limit" setting works with the start value to limit how many addresses can be allocated and thereby defining the DHCP addresses that can be allocated. In our example of starting our DHCP pool at 192.168.85.100 if we use the default value of 150 ro the "Limit" setting that results in the system allocating Ip addresses from 192.168.85.100 to 192.168.85.250. Or otherwise limiting the allocation to 150 addresses above the "Start" setting. This is a required setting if DHCP server is enabled.
es: El ajuste "Límite" funciona con el valor de inicio para limitar el número de direcciones que se pueden asignar y así definir las direcciones DHCP que se pueden asignar. En nuestro ejemplo de iniciar nuestro grupo DHCP en 192.168.85.100, si utilizamos el valor predeterminado de 150 ro la configuración "Límite" resulta en el sistema asignando direcciones Ip de 192.168.85.100 a 192.168.85.250. O de lo contrario, limitar la asignación a 150 direcciones por encima de la configuración "Inicio". Esta es una configuración necesaria si el servidor DHCP está activado.

source: The "Lease time" setting defines the length of time that the DHCP Lease is valid. This is a required setting if DHCP server is enabled.
es: El ajuste "Tiempo de concesión" define la longitud de tiempo en el que la concesión DHCP es válida. Esta es una configuración necesaria si el servidor DHCP está activado.

source: To configure DHCPv6 settings click the "IPv6 Settings" tab.
es: Para configurar los ajustes de DHCPv6 haga clic en la pestaña "Configuración de IPv6".

source: On this tab we see the DHCPv6 settings. The most commonly used settings are as follows.
es: En esta pestaña vemos la configuración de DHCPv6. Los ajustes más utilizados son los siguientes.

source: Router Advertisement-Service
es: Servicio de notificación del router

source: DHCPv6-Service
es: Servicio DHCPv6

source: DHCPv6-Mode
es: Modo DHCPv6

source: Announced DNS servers
es: Servidores DNS anunciados

source: The "Router Advertisement-Service" enables the Opuntia system to send IPv6 router Advertisement packets on this interface. This allows client devices to learn that the Opuntia system is acting as a router for this network. It also serves as the primary enabler for the usage of SLAAC (Stateless address autoconfiguration) to automatically configure IPv6 networks. The recommended value is "Server mode".
es: La opción "Servicio de notificación del router" (Router Advertisement-Service) permite al sistema Opuntia enviar paquetes de notificación de router IPv6 en esta interfaz. Esto permite que los dispositivos cliente sepan que el sistema Opuntia está actuando como un router para esta red. También sirve como el principal habilitador para el uso de SLAAC (Configuración automática de direcciones sin estado) para configurar automáticamente las redes IPv6. El valor recomendado es "Modo servidor".

source: The "DHCPv6-Service" is the setting that actually starts DHCPv6 on the Interface. The recommended value is "Server mode".
es: El "Servicio DHCPv6" es la configuración que inicia efectivamente DHCPv6 en la interfaz. El valor recomendado es "Modo servidor".

source: The "DHCPv6-Mode" controls the operating mode of the DHCPv6 Server. This settting will be explained in more detail in the DHCP Server chapter. The recommended value is "Stateless + Stateful".
es: El "Modo DHCPv6" controla el modo de funcionamiento del servidor DHCPv6. Esta configuración se explicará con más detalle en el capítulo Servidor DHCP. El valor recomendado es "Sin estado + Con estado" (Stateless + Stateful).

source: The last most commonly configured IPv6 DHCPv6 is "Announced DNS servers". This value is very similar to setting the DNS server option for IPv4. This allows the DHCPv6 clients to learn a list of DNS servers. This is an optional setting since you may learn DNS servers from IPv4 DHCP or other methods.
es: La última configuración más común de IPv6 DHCPv6 es la de "servidores DNS anunciados". Este valor es muy similar a la configuración de la opción de servidor DNS para IPv4. Esto permite a los clientes DHCPv6 que sepan una lista de servidores DNS. Esta es una configuración opcional, ya que puede conocer los servidores DNS desde el DHCP IPv4 u otros métodos.

source: One interesting thing about the "Announced DNS servers" setting is that you can announce IPv4 or IPv6 DNS servers addresses using this configuration value. Depending on the enviorment, it may be valid to only have IPv4 DNS servers specified in the IPv6 DHCPv6 service.
es: Una cosa interesante sobre la configuración de "Servidores DNS anunciados" es que puede anunciar direcciones de servidores DNS IPv4 o IPv6 utilizando este valor de configuración. Dependiendo del entorno, puede ser válido tener sólo servidores DNS IPv4 especificados en el servicio DHCPv6 IPv6.

source: **Static IPv6**
es: **IPv6 estático**

source: There are several deployment scenarios where you will not recieve an IPv6 prefix delegation. Typically this is when you are learning IPv6 routes over a dynamic routing protocol such as BGP or Ospfv3. In these cases you are required to set a IPv6 manually on interfaces. To get started, you first must be sure that the "IPv6 assignment length" setting is set to disabled.
es: Hay varios escenarios de implementación en los que no recibirá una delegación de prefijo IPv6. Normalmente esto ocurre cuando se conocen rutas IPv6 a través de un protocolo de enrutamiento dinámico como BGP u Ospfv3. En estos casos es necesario configurar un IPv6 de manera manual en las interfaces. Para empezar, primero debe asegurarse de que el ajuste "Longitud de la asignación IPv6" está desactivado.

source: By disabling the "IPv6 assignment length" you will now see these configuration options.
es: Al desactivar la "Longitud de asignación IPv6" ahora verá estas opciones de configuración.

source: IPv6 address
es: Dirección IPv6

source: IPv6 gateway
es: Puerta de enlace IPv6

source: IPv6 routed Prefix
es: Prefijo enrutado IPv6

source: IPv6 suffix
es: Sufijo IPv6

source: Given that IPv6 fundementatly supports multiple addresses per interface; CIDR List notation is the only option for manually setting IPv6 addresses. Be sure to click the small check box at the end of the IPv6 address box. Below is an example of adding multiple IPv6 addresses to an interface.
es: Dado que IPv6 soporta fundamentalmente múltiples direcciones por interfaz, la notación de la lista CIDR es la única opción para configurar manualmente las direcciones IPv6. Asegúrese de hacer clic en la pequeña casilla de verificación al final del cuadro de dirección IPv6. A continuación se muestra un ejemplo de cómo añadir varias direcciones IPv6 a una interfaz.

source: The "IPv6 routed Prefix" is used with the built-in IPv6 management system. This allows the system administrator to specify a static IPv6 Prefix that is distrubted to clients devices using DHCPv6. DHCPv6 **MUST** enabled for this setting to be effective. Since this prefix range is specified manually by the administrator; the administrator must ensure that this IPv6 Prefix range is routed to the Opuntia system. This can be done using dynamic routing protocols like BGP, Ospfv3 or static routes.
es: El "prefijo enrutado IPv6" se utiliza con el sistema de gestión IPv6 incorporado. Esto permite al administrador del sistema especificar un prefijo IPv6 estático que se distribuye a los dispositivos cliente utilizando DHCPv6. DHCPv6 **DEBE** estar activado para que esta configuración sea efectiva. Dado que este intervalo de prefijos se especifica de manera manual por el administrador; éste debe asegurarse de que este intervalo de prefijos IPv6 sea enrutado al sistema Opuntia. Esto puede hacerse utilizando protocolos de enrutamiento dinámico como BGP, Ospfv3 o rutas estáticas.

source: The "IPv6 suffix" sets the IPv6 Interface ID. This is the last 64bits of a IPv6 address. This allows the administrator to control the last part of an IPv6 address that is assigned. This setting only takes effect if you have also specified a "IPv6 routed Prefix". This setting has a default value of "::1".
es: El "sufijo IPv6" establece la ID de la interfaz IPv6. Son los últimos 64 bits de una dirección IPv6. Esto permite al administrador controlar la última parte de una dirección IPv6 que se asigna. Esta configuración sólo tiene efecto si también ha especificado un "Prefijo enrutado IPv6". Este ajuste tiene un valor predeterminado de "::1".
