Repository: imagestream/opuntia-docs
Catalog: locales/*/LC_MESSAGES/rr1000.po
Languages: es

source: RR1000 Hardware details
es: Información del hardware del RR1000

source: The RR1000 a router, vpn server, security device and edge compute platform depending on software and hardware configurations.
es: El RR1000 es un router, un servidor vpn, un dispositivo de seguridad y una plataforma de computación de borde (edge), dependiendo de las configuraciones de software y hardware.

source: The router has six Ethernet Interfaces.
es: El router tiene seis interfaces Ethernet.

source: Rebel Router QuickStart Guide
es: Guía de inicio rápido del router Rebel

source: The Rebel Router (RR1000) is configured by default to allow access via several different methods.
es: El router Rebel (RR1000) está configurado por defecto para permitir el acceso a través de varios métodos diferentes.

source: Access via Ethernet using SSH
es: Acceso vía Ethernet mediante SSH

source: Access via Ethernet using the Web Interface
es: Acceso vía Ethernet mediante la interfaz web

source: Access using the built-in console port
es: Acceso mediante el puerto de consola integrado

source: Table of Contents
es: Índice

source: The documentation for the RR1000 is still a work in progress.
es: La documentación del RR1000 sigue siendo un trabajo en curso.

source: The RR1000 is configured by default to allow access via several different methods.
es: El RR1000 está configurado por defecto para permitir el acceso a través de varios métodos diferentes.

source: Access via the Serial Interface
es: Acceso vía interfaz serie

source: Ethernet Connectivity
es: Conectividad Ethernet

source: The Ethernet interface on the RR1000 supports auto mdi/mdix so the interface can be connected directly to a client device or an Ethernet switch with a standard Ethernet cable.
es: La interfaz Ethernet del RR1000 es compatible con auto-mdi/mdix, por lo que la interfaz puede conectarse directamente a un dispositivo cliente o a un conmutador Ethernet con un cable Ethernet estándar.

source: The RR1000 has a single Ethernet interface. The default configuration of the RR1000 is to bridge the Ethernet interface with the wireless radio. Due to this default configuration the RR1000 defaults to acting as a DHCP client. It will receive an ip address from any existing DHCP servers that are present on the network connected to the Ethernet interface.
es: El RR1000 tiene una sola interfaz Ethernet. La configuración por defecto del RR1000 es la de puentear la interfaz Ethernet con la radio inalámbrica. Debido a esta configuración por defecto, el RR1000 actúa por defecto como cliente DHCP. Recibirá una dirección ip de cualquier servidor DHCP existente que se encuentre presente en la red conectada a la interfaz Ethernet.

source: If the RR1000 fails to obtain an DHCP lease within the first 60 seconds; the RR1000 will switch modes and it will assign 10.10.199.1/24 to the Ethernet interface. In this failback mode the RR1000 will then be accessable using this self-assigned address.
es: Si el RR1000 no consigue obtener una concesión DHCP en los primeros 60 segundos, el RR1000 cambiará de modo y asignará 10.10.199.1/24 a la interfaz Ethernet. En este modo de emergencia, el RR1000 será accesible utilizando esta dirección autoasignada.

source: Once you have determined the correct IPv4 address you can then move to accessing the RR1000 via the Web GUI or via SSH.
es: Una vez que usted haya determinado la dirección IPv4 correcta, puede seguir para acceder al RR1000 a través de la GUI Web o vía SSH.

source: The RR1000 will obtain an IPv6 address using DHCPv6 or SLAAC (Stateless Address Autoconfiguration) if these methods are present on the connected network.
es: El RR1000 obtendrá una dirección IPv6 utilizando DHCPv6 o SLAAC (Configuración automática de direcciones sin estado) si estos métodos están presentes en la red conectada.

source: The RR1000 will always configure an IPv6 Link local address based on the MAC address([1]_) of the RR1000. This Link local IPv6 address is present at all times even if IPv4 and other IPv6 configurations are invalid. So the Link local address is the most relaible way to access the RR1000. Since this address is based on the MAC address of the Ethernet interface it is unquie to each RR1000. An easy method to determine this address is to send a ping packet to the IPv6 "all routers" multicast address(ff02::2).
es: El RR1000 siempre configurará una dirección de enlace local IPv6 basada en la dirección MAC ([1]_) del RR1000. Esta dirección de enlace local IPv6 está presente en todo momento, incluso si otras configuraciones IPv4 e IPv6 no son válidas. Por lo tanto, la dirección de enlace local es la forma más fiable de acceder al RR1000. Dado que esta dirección se basa en la dirección MAC de la interfaz Ethernet, es única para cada RR1000. Un método sencillo para determinar esta dirección es enviar un paquete ping a la dirección multicast IPv6 "de todos los router" (ff02::2).

source: For Linux systems this can be done using the following command assuming your Ethernet interface is "eth0". Please note that most operating systems require specifiying the interface in addtion to the address when using Link Local addresses. For example Linux systems would use the following syntax if your interface was "eth0"::
es: Para los sistemas Linux esto se puede hacer mediante el siguiente comando asumiendo que su interfaz Ethernet es "eth0". Tenga en cuenta que la mayoría de los sistemas operativos requieren que se especifique la interfaz además de la dirección cuando se utilizan direcciones de enlace local. Por ejemplo, los sistemas Linux utilizarían la siguiente sintaxis si su interfaz fuera "eth0"::

source: Additionally it's possible to compute the Link Local address using the MAC address. Numerious online calculators can be used to easily find the Link local address([2]_) using the MAC address located on the product label.
es: Además, es posible calcular la dirección de enlace local utilizando la dirección MAC. Se pueden utilizar varias calculadoras en línea para encontrar fácilmente la dirección de enlace local ([2]_) por medio de la dirección MAC que se encuentra en la etiqueta del producto.

source: Once you have determined the correct IPv6 address you can then move to accessing the RR1000 via the Web GUI or via SSH.
es: Una vez que usted haya determinado la dirección IPv6 correcta, puede seguir para acceder al RR1000 a través de la GUI Web o vía SSH.

source: Serial Connectivity
es: Conectividad en serie

source: The RR1000 features a DE-9([3]_) connector using the Rs232 Serial standard. You will need a **Null Serial** connection to connect to this interface. The interface will be running at a baud rate 115,200 bps and using 8 data bits; no parity bit and 1 stop bit; or commonly known as "115.2kbps 8n1".
es: El RR1000 dispone de un conector DE-9([3]_) que utiliza el estándar serie Rs232. Necesitará una conexión **Serie nula** para conectarse a esta interfaz. La interfaz funcionará a una tasa de baudios de 115,200 bps y utilizará 8 bits de datos; sin bit de paridad y 1 bit de parada; o comúnmente conocido como "115.2kbps 8n1".

source: The most likely cause of problems when using the Serial interface is issues with incorrect cables. As noted above, a **Null Serial** cable is required.
es: La causa más probable de los problemas al utilizar la interfaz serie son los problemas con los cables incorrectos. Como se ha indicado anteriormente, se necesita un cable **Serie Nulo**.

source: Web GUI Access
es: Acceso a la interfaz gráfica de usuario (GUI) en la web

source: **Access via Ethernet using the Web Interface - IPv4**
es: ** Acceso vía Ethernet mediante la interfaz web - IPv4**

source: This interface defaults to a network address range of 10.10.199.0/24 with the router configured as 10.10.199.1 and supports DHCP client access.
es: Esta interfaz tiene por defecto un intervalo de direcciones de red de 10.10.199.0/24 con el router configurado como 10.10.199.1 y es compatible con el acceso de cliente DHCP.

source: When the RR1000 is using the failback IPv4 address access the login page use the following url: `https://10.10.199.1/ <https://10.10.199.1>`_
es: Cuando el RR1000 está utilizando la dirección IPv4 de emergencia acceder a la página de inicio de sesión en la siguiente url: `https://10.10.199.1/ <https://10.10.199.1>`_

source: The RR1000 ships with a self-signed ssl certificate. This may cause warning in when connecting to the RR1000 for the first time. These warnings can be safely ignored for accessing the management Web GUI.
es: El RR1000 se entrega con un certificado ssl auto-firmado. Esto puede causar una advertencia al conectarse al RR1000 por primera vez. Estas advertencias pueden ignorarse de manera segura para acceder a la GUI de la web de gestión.

source: The admin username is "**root**". The default password is "**imagestream**".
es: El nombre de usuario del administrador es "**root**". La contraseña por defecto es "**imagestream**".

source: We strongly recommend that you change the default password as your first configuration change.
es: Le recomendamos encarecidamente que cambie la contraseña predeterminada como primer cambio en la configuración.

source: **Access via Ethernet using the Web Interface - IPv6**
es: ** Acceso vía Ethernet mediante la interfaz web - IPv6**

source: To access the Web GUI using using IPv6 the method is similar to using IPv4. To enter a IPv6 addresses in a web browser use the following syntax. If we assume that you determined your Ipv6 Link Local address is "fe80::b291:37ff:fe05:1" then the correct url would be as follows::
es: Para acceder a la GUI Web utilizando IPv6 el método es similar al de utilizar IPv4. Para introducir una dirección IPv6 en un navegador web utilice la siguiente sintaxis. Si asumimos que usted determinó que su dirección de enlace local Ipv6 es "fe80::b291:37ff:fe05:1" entonces la url correcta sería la siguiente::

source: CLI Access via SSH
es: Acceso CLI vía SSH

source: **IPv4 & IPv6**
es: **IPv4 e IPv6**

source: The RR1000 can also be accessed via SSH. Using the ip address of the RR1000 connect as user root. If the RR1000 is in failback IPv4 mode the ip address will be 10.10.199.1. If the RR1000 is using DHCP or DHCPv6 you need to determine which address was a assigned by looking at your DHCP sever. In the following screenshot the address was assigned via DHCP.
es: El RR1000 también se puede acceder vía SSH. Usando la dirección ip del RR1000 conéctese como usuario root. Si el RR1000 está en modo IPv4 de emergencia (failback) la dirección ip será 10.10.199.1. Si el RR1000 está usando DHCP o DHCPv6 necesita determinar qué dirección fue asignada revisando su servidor DHCP. En la siguiente captura de pantalla la dirección fue asignada vía DHCP.

source: CLI Access via the Serial Interface
es: Acceso CLI vía interfaz serie

source: The RR1000 has a built in DE-9 Rs232 Interface. When connecting via the Serial Interface; to access the CLI no password is currently required (as of Opuntia version 4.8.16). Just connect using this interface (for details see above) and press the "enter" key.
es: El RR1000 cuenta con una interfaz DE-9 Rs232 integrada. Cuando se conecta vía Interfaz Serie; para acceder a la CLI no se requiere actualmente ninguna contraseña (a partir de la versión 4.8.16 de Opuntia). Sólo tiene que conectarse mediante esta interfaz (para más información, véase más arriba) y pulsar la tecla "enter".

source: Footnotes
es: Notas a pie de página

source: Using the RFC4862 standard for Link Local address creation
es: Uso del estándar RFC4862 para la creación de direcciones de enlace local

source: https://ben.akrin.com/?p=1347 Ipv6 Link Local Calculator
es: https://ben.akrin.com/?p=1347 Calculador de enlace local Ipv6

source: The DE-9 connector is often incorrectly known as an DB-9 interface.
es: El conector DE-9 suele conocerse incorrectamente como interfaz DB-9.
