Repository: imagestream/opuntia-docs
Catalog: locales/*/LC_MESSAGES/sr1000.po
Languages: es

source: Samurai Router Hardware Details
es: Información del hardware del router Samurai

source: Table of Contents
es: Índice

source: Samurai Router
es: Router Samurai

source: The Samurai Router is the top of the line ImageStream Router. The Samurai Router is designed to provide reliable high performace layer 3 routing for demanding applications.
es: El router Samurai es el Enrutador de gama alta de la línea ImageStream. El router Samurai está diseñado para ofrecer un enrutamiento capa 3 fiable y de alto desempeño para aplicaciones exigentes.

source: Key features include
es: Las principales características incluyen

source: Powerful 8 Core CPU
es: Potente CPU de 8 núcleos

source: Two 10Gbase-T 10Gbit Interfaces
es: Dos interfaces 10Gbase-T 10Gbit

source: Two Sfp+ 10Gbit Interfaces
es: Dos interfaces Sfp+ 10Gbit

source: Redundant AC Power Supplies
es: Fuentes de alimentación de CA redundantes

source: four front pannel expansion slots
es: cuatro ranuras de expansión en el panel frontal

source: The four front pannel expansion slots allow any combination of the following expansion cards.
es: Las cuatro ranuras de expansión del panel frontal permiten cualquier combinación de las siguientes tarjetas de expansión.

source: Addon Front pannel Options
es: Opciones complementarias del panel frontal

source: 8 port GbE Rj-45 Interfaces
es: Interfaces de 8 puertos Rj-45 GbE

source: 4 port GbE SFP Interfaces
es: Interfaces de 4 puertos GbE SFP

source: 2 port 10Gbase-T Rj-45 Interfaces
es: Interfaces de 2 puertos Rj-45 10Gbase-T

source: 2 port 25 Gbit SFP28 Interfaces
es: Interfaces de 2 puertos de 25 Gbit SFP28

source: These options allow the Samurai Router to be configured for wide variety of deployment options.
es: Estas opciones permiten configurar el router Samurai para una amplia variedad de opciones de implementación.

source: **System Block Diagram**
es: **Diagrama de bloques del sistema**

source: Built-in Interfaces
es: Interfaces integradas

source: Front Ports and LEDs
es: Puertos y LED frontales

source: Diagram #
es: Núm. de diagrama

source: Case Label
es: Etiqueta de la carcasa

source: Opuntia Dev Name
es: Nombre del dispositivo Opuntia

source: Linux Dev Name
es: Nombre del dispositivo Linux

source: Description
es: Descripción

source: Console
es: Consola

source: Serial Console
es: Serie de la consola

source: 1Gbit Ethernet
es: Ethernet 1Gbit

source: USB 3.0 Type A
es: USB 3.0 Tipo A

source: Console USB
es: Consola USB

source: USB Console
es: Consola USB

source: 5 (bottom)
es: 5 (inferior)

source: 10Gbit Ethernet
es: Ethernet 10Gbit

source: 5 (top)
es: 5 (superior)

source: 6 (bottom)
es: 6 (inferior)

source: SFP+ Interface
es: Interfaz SFP+

source: 6 (top)
es: 6 (superior)

source: Status LED
es: LED de estado

source: UID LED
es: LED UID

source: HDD LED
es: LED HDD

source: Reset LED
es: LED de reinicio

source: Power LED/Button
es: LED/botón de encendido

source: The Management and Management-10g interfaces may be used as normal interfaces in Opuntia. But the Management-10 Interface will always expose the system BMC IPMI. So care should be taken to provide the needed security if using this interface.
es: Las interfaces de gestión, Management y Management-10g pueden utilizarse como interfaces normales en Opuntia. Pero la Interfaz de Management-10 siempre expondrá el sistema BMC IPMI. Por lo tanto, si se utiliza esta interfaz se debe tener cuidado de proporcionar la seguridad necesaria.

source: The management interface will be configured with a static
es: La interfaz de gestión se configurará con una estática

source: The status LED has several different operating modes depending on the current system status. This table shows the different LED apperance and system status.
es: El LED de estado tiene varios modos de funcionamiento que dependen del estado actual del sistema. Esta tabla muestra la apariencia de los diferentes LED y el estado del sistema.

source: LED Apperance
es: Aspecto del LED

source: Solid Green
es: Verde sólido

source: System powered on operating normally
es: Sistema encendido funcionando normalmente

source: Blinking Green
es: Verde parpadeante

source: System is shutting down
es: El sistema se está apagando

source: Solid Red
es: Rojo sólido

source: System is overheating
es: El sistema está sobrecalentado

source: 1 Second Blinking Red
es: Rojo parpadeante 1 segundo

source: System Fan Failure
es: Fallo del ventilador del sistema

source: 1/4 Second Blinking Red
es: Rojo parpadeante 1/4 de segundo

source: System Power Failure
es: Fallo de alimentación del sistema

source: Solid Blue
es: Azul sólido

source: System Local UID enabled
es: Sistema UID local activado

source: 1 Second Blinking Blue
es: Azul parpadeante 1 segundo

source: System Remote UID enabled
es: Sistema UID remoto activado

source: Not lit
es: Sin iluminación

source: System is powered off
es: El sistema está apagado

source: The system UID status is enabaled in the IMPI Interface.
es: El estado del sistema UID está habilitado en la interfaz IMPI.

source: Samuria Router QuickStart Guide
es: Guía de inicio rápido del router Samurai
